using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

#pragma warning disable CA1814 // Prefer jagged arrays over multidimensional

namespace LiteratureSolitaire.Infrastructure.Migrations
{
    /// <inheritdoc />
    public partial class SeedExamData : Migration
    {
        /// <inheritdoc />
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "QuestionPassages",
                keyColumns: new[] { "PassageId", "QuestionId" },
                keyValues: new object[] { 1, 7 });

            migrationBuilder.DeleteData(
                table: "QuestionPassages",
                keyColumns: new[] { "PassageId", "QuestionId" },
                keyValues: new object[] { 2, 7 });

            migrationBuilder.DeleteData(
                table: "QuestionPassages",
                keyColumns: new[] { "PassageId", "QuestionId" },
                keyValues: new object[] { 3, 8 });

            migrationBuilder.DeleteData(
                table: "QuestionPassages",
                keyColumns: new[] { "PassageId", "QuestionId" },
                keyValues: new object[] { 4, 8 });

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 5,
                column: "Content",
                value: "А");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 6,
                columns: new[] { "Content", "IsCorrect" },
                values: new object[] { "Б", false });

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 7,
                column: "Content",
                value: "В");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 8,
                columns: new[] { "Content", "IsCorrect" },
                values: new object[] { "Г", true });

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 9,
                columns: new[] { "Content", "IsCorrect" },
                values: new object[] { "През последните години екотуризмът у нас се развива успешно.", false });

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 10,
                column: "Content",
                value: "Нашите електрически уреди се предлагат с 24-месечна гаранция.");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 11,
                column: "Content",
                value: "В края на този месец ще назначим още един помощник-аптекар.");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 12,
                columns: new[] { "Content", "IsCorrect" },
                values: new object[] { "Планинският маршрут се оказа доста по опасен от очакванията ни", true });

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 13,
                columns: new[] { "Content", "IsCorrect" },
                values: new object[] { "изживяни", false });

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 14,
                column: "Content",
                value: "усмисляне");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 15,
                columns: new[] { "Content", "IsCorrect" },
                values: new object[] { "оттегляне", true });

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 16,
                column: "Content",
                value: "обесценен");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 17,
                column: "Content",
                value: "За решаването на задачата се изисква използване на два алгоритъма.");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 18,
                column: "Content",
                value: "В Българската народна банка е изложена колекция от юбилейни монети.");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 19,
                columns: new[] { "Content", "IsCorrect" },
                values: new object[] { "След операция на рамото се налага рехабилитация със физиотерапевт.", true });

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 20,
                columns: new[] { "Content", "IsCorrect" },
                values: new object[] { "Отдадеността на професията винаги носи истинско удовлетворение.", false });

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 21,
                column: "Content",
                value: "Тази година надпреварата за голмайсторския приз е изключително оспорвана.");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 22,
                column: "Content",
                value: "10 годишното момче показа завидни способности в областта на математиката.");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 23,
                column: "Content",
                value: "Белите тигри са много красиви със своите светло-кафяви ивици и сини очи.");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 24,
                column: "Content",
                value: "Радио предавателите са устройства, които преобразуват звуковите трептения.");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 25,
                column: "Content",
                value: "вариянт");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 26,
                columns: new[] { "Content", "IsCorrect" },
                values: new object[] { "уредник", true });

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 27,
                columns: new[] { "Content", "IsCorrect" },
                values: new object[] { "съвременици", false });

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 28,
                column: "Content",
                value: "потчертавам");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 29,
                columns: new[] { "Content", "IsCorrect" },
                values: new object[] { "Победителят взе преднина във финалния етап на състезанието.", false });

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 30,
                column: "Content",
                value: "Изследователят има публикации в авторитетни научни списания.");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 31,
                columns: new[] { "Content", "IsCorrect" },
                values: new object[] { "Алпинистът трябва да е издържлив и физически, и психически.", true });

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 32,
                column: "Content",
                value: "По учебен план дисциплината се изучава през последния семестър");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 33,
                column: "Content",
                value: "Върху кръгла масичка беше поставена бледозелена стъклена ваза с цветя.");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 34,
                columns: new[] { "Content", "IsCorrect" },
                values: new object[] { "Открита е изложба с картини на известен белгийски художник-експресионист.", true });

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 35,
                column: "Content",
                value: "Приятелят ми започна работа като звукорежисьор в един столичен театър.");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 36,
                columns: new[] { "Content", "IsCorrect" },
                values: new object[] { "В центъра на града е издигнат 30-метров паметник на великия композитор", false });

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 37,
                column: "Content",
                value: "социялен");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 38,
                column: "Content",
                value: "възмажали");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 39,
                columns: new[] { "Content", "IsCorrect" },
                values: new object[] { "съчувствие", true });

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 40,
                columns: new[] { "Content", "IsCorrect" },
                values: new object[] { "раскрасяване", false });

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 41,
                column: "Content",
                value: "Една от най-известните забележителности на Париж е Триумфалната арка.");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 42,
                column: "Content",
                value: "Потребителите оцениха положително новите компютърни конфигурации.");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 43,
                column: "Content",
                value: "Много хора се одзоваха на призива да помогнат на бедстващото семейство. – Правилен");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 44,
                column: "Content",
                value: "Информацията за фирмите се съхранява в няколко отделни регистъра");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 45,
                columns: new[] { "Content", "IsCorrect" },
                values: new object[] { "Направих справка къде могат да се платят здравно осигурителните вноски.", true });

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 46,
                columns: new[] { "Content", "IsCorrect" },
                values: new object[] { "Събитието е отразено накратко във всички национални и регионални медии.", false });

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 47,
                column: "Content",
                value: "100-годишнината от рождението на поета е литературното събитие на месеца.");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 48,
                column: "Content",
                value: "Възмутен съм от хората, които нехаят за природните ресурси и ги унищожават.");

            migrationBuilder.UpdateData(
                table: "ExamSessions",
                keyColumn: "Id",
                keyValue: 2,
                columns: new[] { "Session", "Year" },
                values: new object[] { "August", 2026 });

            migrationBuilder.InsertData(
                table: "ExamSessions",
                columns: new[] { "Id", "Session", "Year" },
                values: new object[,]
                {
                    { 3, "May", 2025 },
                    { 4, "August", 2025 },
                    { 5, "May", 2024 },
                    { 6, "August", 2024 },
                    { 7, "May", 2023 },
                    { 8, "August", 2023 },
                    { 9, "May", 2022 },
                    { 10, "August", 2022 }
                });

            migrationBuilder.UpdateData(
                table: "Passages",
                keyColumn: "Id",
                keyValue: 2,
                column: "ImagePath",
                value: "/images/texts/text2026M.png");

            migrationBuilder.UpdateData(
                table: "Passages",
                keyColumn: "Id",
                keyValue: 3,
                column: "Content",
                value: "Натрапчивата потребност да се прекарва голяма част от времето онлайн, се дефинира в научната литература като патологично състояние. Привличани ежедневно от бързия и лесен достъп до разнообразно онлайн съдържание (музика, видео, игри, постове, реклами), някои хора неусетно могат да станат зависими от него и да се превърнат в „нетохолици“. Обичайна практика е да се следи реакцията в социалните мрежи на публикувана снимка или текст. Зависимостта от броя виртуални харесвания, коментари и споделяния обаче влияе върху самочувствието. Социалните медии създават изкривена представа за 3 реалността. Чрез тях всеки предпочита да споделя снимки и видеа от живота си, показващи само позитивни и идеализирани моменти, като по този начин се формират стереотипи за визия и поведение. Потребителите на дигиталното медийно съдържание често се съизмерват с тези стереотипи, което може да доведе до чувство за непълноценност и до понижаване на самочувствието. Възможно е постоянното следване на успешни или популярни личности да засили усещането за провал и да доведе до ниска самооценка, тъй като фокусът се измества от личните потребности към социалното одобрение. Дигиталната среда насърчава културата на мигновеното удовлетворение, а това води до зависимост от кратки емоционални стимули. В социалните мрежи се използват кратки форми на съдържание – видеа и съобщения, които се редуват непрекъснато. Понеже свикват да реагират на такива стимули, много млади хора често имат проблеми с концентрацията и това им пречи да се фокусират върху задачи в училище, изискващи по-задълбочен анализ и критическо мислене. Младежите, които отдѐлят много време за онлайн игри, нерядко се откъсват от действителността, като така губят способността си да се справят ефективно със стреса в реалния живот. Възможно е да започнат да се чувстват депресирани или тревожни, защото не са изградили необходимите стратегии за справяне с проблемни ситуации. Пристрастяването към дигиталния свят не се усеща веднага – истинските преживявания постепенно се подменят с моментни удоволствия. Онлайн пространството създава илюзия за емоционална обвързаност и често оставя незадоволена потребността от искрена човешка емоция и разбиране. Постоянната „врява“ от известия, съобщения и видеа в него заглушава вътрешния ни диалог. Влизането в режим на „дигитална пауза“ или в режим на „мълчание“ в мрежата, от друга страна, помага за възстановяване на психичното равновесие и дава възможност за укрепване на емоционалната интелигентност.");

            migrationBuilder.UpdateData(
                table: "Passages",
                keyColumn: "Id",
                keyValue: 4,
                column: "ImagePath",
                value: "/images/texts/text2026A.png");

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 2,
                columns: new[] { "Content", "ExamSessionId" },
                values: new object[] { "В коя от подчертаните думи е допусната правописна грешка? Двата нови спектакъла (", 1 });

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 3,
                columns: new[] { "Content", "QuestionTypeId" },
                values: new object[] { "В кое изречение е допусната правописна грешка?", 1 });

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 4,
                columns: new[] { "Content", "QuestionTypeId" },
                values: new object[] { "В кой ред думата е изписана правилно?", 1 });

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 5,
                columns: new[] { "Content", "ExamSessionId", "QuestionTypeId" },
                values: new object[] { "В кое изречение е допусната правописна грешка?", 2, 1 });

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 6,
                columns: new[] { "Content", "QuestionTypeId" },
                values: new object[] { "В кое изречение НЕ е допусната правописна грешка?", 1 });

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 7,
                columns: new[] { "Content", "ExamSessionId", "QuestionTypeId" },
                values: new object[] { "В кой ред думата е изписана правилно?", 3, 1 });

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 8,
                columns: new[] { "Content", "ExamSessionId", "QuestionTypeId" },
                values: new object[] { "В кое изречение е допусната правописна грешка?", 3, 1 });

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 9,
                columns: new[] { "Content", "ExamSessionId", "QuestionTypeId" },
                values: new object[] { "В кое изречение е допусната правописна грешка?", 3, 1 });

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 10,
                columns: new[] { "Content", "ExamSessionId", "QuestionTypeId" },
                values: new object[] { "В кой ред думата е изписана правилно?", 5, 1 });

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 11,
                columns: new[] { "Content", "ExamSessionId", "QuestionTypeId" },
                values: new object[] { "В кое изречение е допусната правописна грешка?", 5, 1 });

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 12,
                columns: new[] { "Content", "ExamSessionId", "QuestionTypeId" },
                values: new object[] { "В кое изречение е допусната правописна грешка?", 5, 1 });

            migrationBuilder.InsertData(
                table: "Questions",
                columns: new[] { "Id", "Content", "ExamSessionId", "QuestionTypeId" },
                values: new object[,]
                {
                    { 28, "В кое изречение НЕ е допусната граматична грешка?", 1, 2 },
                    { 29, "В кое изречение е допусната граматична грешка?", 1, 2 },
                    { 30, "В кое изречение е допусната граматична грешка?", 2, 2 },
                    { 31, "В кое изречение НЕ е допусната граматична грешка?", 2, 2 },
                    { 48, "В кое изречение НЕ е допусната пунктуационна грешка?", 1, 3 },
                    { 49, "В кое изречение е допусната пунктуационна грешка?", 1, 3 },
                    { 50, "В кое изречение е допусната пунктуационна грешка?", 2, 3 },
                    { 51, "В коя от позициите, означени с букви, е допусната пунктуационна грешка? Човек разбира, (", 2, 3 },
                    { 68, "Кое НЕ стимулира младите хора да гледат кратки видеа според Текст 1?", 1, 4 },
                    { 69, "Кое е вярно за инфлуенсърите според Текст 1?", 1, 4 },
                    { 70, "Кое от твърденията съответства по смисъл на цитираното изречение от Текст 1? Несъмнено потреблението на видеосъдържание има и своята тъмна страна.", 1, 4 },
                    { 71, "Кое твърдение е вярно според информацията в Текст 2?", 1, 4 },
                    { 72, "Кои хора е най-вероятно да НЕ са податливи към зависимостта от дигиталната среда според Текст 1?", 2, 4 },
                    { 73, "Според информацията в Текст 1 може да се направи изводът, че общуването в социалните мрежи:", 2, 4 },
                    { 74, "Според Текст 1 истински са преживяванията, които:", 2, 4 },
                    { 75, "Коя от посочените тенденции съответства на данните от Текст 2?", 2, 4 },
                    { 108, "Кой проблем е заложен в интерпретацията на темата за творчеството в „Балада за Георг Хених“?", 1, 5 },
                    { 109, "Кой от мотивите НЕ е интерпретиран в „Новото гробище над Сливница“?", 1, 5 },
                    { 110, "Като кулминационен в „Градушка“ може да се определи моментът, в който:", 1, 5 },
                    { 111, "Кои стихове от „Вяра“ насочват към идеята, че любовта към живота се изразява и в готовността за поемане на риск?", 1, 5 },
                    { 112, "Кое тълкуване на цитирания израз от „Две души“ съответства на смисъла на творбата?\r\n„ Аз сам не живея – горя! „", 1, 5 },
                    { 113, "Кое от твърденията е вярно?", 1, 5 },
                    { 114, "Вярата в чудото присъства:", 1, 5 },
                    { 115, "В коя от посочените двойки творби се утвърждава паметта за миналото в неговите всекидневни измерения?", 1, 5 },
                    { 116, "Кой конфликт е заложен в интерпретацията на темата за любовта в „Колко си хубава!“?", 2, 5 },
                    { 117, "Кой от мотивите е интерпретиран и в двата посочени откъса? \r\n„С живота под вежди \r\nсе гледаме строго \r\nи боря се с него, \r\nдоколкото мога. \r\nС живота сме в разпра…“\r\n(Н. Вапцаров, „Вяра“) \r\n„Живот без маска и без грим – \r\nозъбено, свирепо куче. \r\nИ трябва да се бориш неуморно, \r\nи трябва да си страшно упорит, \r\nза да изтръгнеш от зъбите \r\nна туй настръхнало вбесено псе \r\nпарченце хляб. „\r\n(Н. Вапцаров, „Завод“)", 2, 5 },
                    { 118, "В кой от следните цитати природата е представена като разрушителна сила?", 2, 5 },
                    { 119, "Кое от твърденията е вярно за Андрешко според диалога между него и съдияизпълнителя? „– Пусто дърво недодялано! От сиромашия се оплакват, а пиянстват като скотове… \r\n– От добро ли е?… Не, не е от добро… Че пиянстват – пиянстват, всички пиянстват. За добро, а не от добро… Това човек като вас може и да си го запише. \r\n– А-а, май и ти си пийнал, приятелю! Пък млад си още, мустаци не са ти никнали… Вашите селяци, пиши ги пропаднал народ и туйто! \r\n– Пиши ги ти, господине, ние не знаем да пишем – рече момъкът…“", 2, 5 },
                    { 120, "Кое твърдение за думите на Бай Ганьо е вярно? \r\n„Ти седни тази вечер, па напиши една уводна статия. Тегли му едно верноподаничество, че сам князът да се слиса. Тури там: Ваши  смирени  чада, Наш  баща  и  татко, в  праха  на Августейшите  ви  нозе, нареди ги там като броеница, ти знаеш как. Па помени и за народа една-две думи, както му е редът. „", 2, 5 },
                    { 121, "Кое от твърденията е вярно?", 2, 5 },
                    { 122, "В коя творба изборът се утвърждава като порив към себеосъществяване?", 2, 5 },
                    { 123, "Кое от твърденията за описанието от „Спасова могила“ е НЕВЯРНО? \r\n„В тъмнината се мяркаха мълчаливо и тайнствено човешки сенки като призраци, които внезапно никнеха из земята и пак потъваха в нея. Тук-там горяха огньове и около тях се чуваха откъслечни разговори или продължителни, дълбоки и болезнени охкания, от които настръхваше косата на малкия Монка.“", 2, 5 },
                    { 124, "Заплахата творчеството да измени на мисията си, е разкрита:", 2, 5 },
                    { 125, "Коя от посочените двойки творби разкрива творчеството като създаващо памет?", 2, 5 },
                    { 206, "Коя тема е интерпретирана в откъса от стихотворението „И пак на дъщеря ми“ на Станка Пенчева? \r\n„От всяко свое пътуване \r\nвсе ти носех по нещо – да те зарадвам, \r\nда усетиш дъха на далечините. \r\nКак обичах завръщането, \r\nпрегръдката ни по летища и гари, \r\nразговорите до среднощ... \r\nТози път,\r\n от най-далечното свое пътуване \r\nняма нищичко да ти донеса.\r\n Само – болка и сиротство, \r\nсамо – заглъхващ спомен \r\nза лицето ми, за гласа, \r\nза облака от любов,\r\n с който те обгръщах... \r\nНикога нищо няма да узнаеш \r\nза най-странното мое пътуване.“", 1, 6 },
                    { 207, "Коя тема е интерпретирана в текста на Елисавета Багряна?\r\n „Сега зная: не греят в небето звездите \r\nза отмора на нашите погледи влюбени,\r\n не тъмнее дъбът, не ухаят липите,\r\n за да можем под тях като в сън да се губим… \r\nЕто, ти си отиде – и аз ще си ида. \r\nОще някоя пролет и лято, \r\nи зима – и на двата ни кръста, далечни, невидими, \r\nимената ни може би няма да има. \r\nА в небето звездите все тъй ще си светят \r\nи ще тегнат гроздовете зрели наесен, \r\nа напролет отново ще цъфнат дърветата \r\nи под тях други двама ще минат унесени.“", 2, 6 }
                });

            migrationBuilder.InsertData(
                table: "Answers",
                columns: new[] { "Id", "Content", "IsCorrect", "QuestionId" },
                values: new object[,]
                {
                    { 109, "Още с дебютната си роля младата актриса спечели симпатиите на публиката.", true, 28 },
                    { 110, "Ще поставим на обществено обсъждане още два много сериозни проблеми.", false, 28 },
                    { 111, "Новия роман на писателя може да бъде закупен с отстъпка до края на месеца.", false, 28 },
                    { 112, "Човешкото ухо има способността да разграничава високите и ниски тонове.", false, 28 },
                    { 113, "В книгата се проследяват историческите връзки между българския и чешкия народ.", false, 29 },
                    { 114, "Художникът, чиито картини се излагат предимно в чужбина, пристигна в България.", false, 29 },
                    { 115, "В Българска телеграфна агенция е обявен конкурс за нови регионални кореспонденти.", true, 29 },
                    { 116, "Госпожо Димитрова, радваме се да Ви съобщим, че сте преминали успешно интервюто.", false, 29 },
                    { 117, "От имунитета ни зависи колко често ще боледуваме и колко бързо ще оздравеем.", false, 30 },
                    { 118, "В заснежения двор отсреща подскачаха един срещу друг два изгладнели врабеца.", false, 30 },
                    { 119, "На телевизионния екран зрителите виждат изписан телефонът за връзка със студиото.", true, 30 },
                    { 120, "Гласувани са законови промени, свързани с имуществените и наследствените отношения.", false, 30 },
                    { 121, "Полският и чешкият отбори са с най-високи резултати преди финала на състезанието.", false, 31 },
                    { 122, "Не пропуснах възможността да се срещна с писателя, чийто книги чета с увлечение.", false, 31 },
                    { 123, "Известно е, че Българската телеграфна агенция е създадена с указ на княз Фердинанд.", true, 31 },
                    { 124, "Госпожо Георгиева, дали бихте приела поканата ни да участвате в дискусията утре?", false, 31 },
                    { 189, "Мусоните са характерни както за части от Азия така и за части от Австралия.", false, 48 },
                    { 190, "Вацлав Хавел, първият президент на Чехия е автор на около двадесет пиеси.", false, 48 },
                    { 191, "Госпожо Иванова поръчаният от Вас продукт е пристигнал в офиса на фирмата.", false, 48 },
                    { 192, "Божурът е символ на успеха, богатството и любовта, както и на благополучието.", true, 48 },
                    { 193, "Шумът от улицата ту се усилваше, ту заглъхваше, но това изобщо не ми пречеше да работя.", false, 49 },
                    { 194, "Когато човек открие целта на живота си, тогава ще намери и пътя, по който да стигне до нея.", false, 49 },
                    { 195, "Ще бъдат постигнати повече спортни успехи, едва когато се изгради добра материална база.", true, 49 },
                    { 196, "Съучениците се разхождаха в парка, радваха се на хубавото време и оживено разговаряха.", false, 49 },
                    { 197, "Предвестници на пролетта са, както белоснежното кокиче, така и жълтата иглика.", true, 50 },
                    { 198, "Земята притихна под нощното небе, огряно от луната и обсипано с безброй звезди.", false, 50 },
                    { 199, "Известен като автор на разкази, писателят изненада читателите със стихосбирка.", false, 50 },
                    { 200, "Уважаеми дарители, благодарим Ви за участието в благотворителната кампания!", false, 50 },
                    { 201, "А", true, 51 },
                    { 202, "Б", false, 51 },
                    { 203, "В", false, 51 },
                    { 204, "Г", false, 51 },
                    { 269, "Възможността набързо да се запознаят с нещо забавно и вдъхновяващо.", false, 68 },
                    { 270, "Лесният достъп до различни дигитални платформи за видеосподеляне.", false, 68 },
                    { 271, "Удобството за няколко минути да научат най-важното от учебния материал.", true, 68 },
                    { 272, "Мигновеното развлечение от гледането на разнообразни забавни ситуации.", false, 68 },
                    { 273, "Притежават способността да вдъхновяват младите хора.", true, 69 },
                    { 274, "Стремят се да определят ежедневно най-новите тенденции.", false, 69 },
                    { 275, "Превръщат се в модел за подражание на всички зрители.", false, 69 },
                    { 276, "Имат за цел да получават възможно най-много харесвания.", false, 69 },
                    { 277, "Споделянето на видеоклипове е безопасно за потребителите.", false, 70 },
                    { 278, "Гледането на видеоклипове безспорно крие известни рискове.", true, 70 },
                    { 279, "Видеата стимулират младите да търсят новото и непознатото.", false, 70 },
                    { 280, "Кратките клипове са мостове към сърцата на милиони млади хора.", false, 70 },
                    { 281, "Тези, които използват платформите за гледане на образователни видеа, са повече от използващите платформите за следване на популярни личности.", false, 71 },
                    { 282, "Тези, които използват платформите за слушане и споделяне на музика, и тези, които използват платформите за информация за здраве и красота, са еднакъв процент.", false, 71 },
                    { 283, "Използващите платформите за информация за здраве и красота са по-малко от тези, които ги използват за гледане на образователни видеа.", false, 71 },
                    { 284, "Използващите платформите за слушане и споделяне на музика са по-малко от тези, които ги използват за следване на популярни личности.", true, 71 },
                    { 285, "Тези, които са привлечени от разнообразните моментни дигитални удоволствия.", false, 72 },
                    { 286, "Тези, които се противопоставят на различните ежедневни онлайн изкушения.", true, 72 },
                    { 287, "Тези, които се влияят от изкривената представа за реалността в социалните мрежи.", false, 72 },
                    { 288, "Тези, на които им въздействат кратките дигитални емоционални стимули в интернет.", false, 72 },
                    { 289, "Насърчава създаването на виртуални приятелства, които не остават мимолетни.", false, 73 },
                    { 290, "Принуждава хората да се състезават помежду си за печелене на популярност.", false, 73 },
                    { 291, "Поощрява критическото мислене при даване на мигновен отговор.", false, 73 },
                    { 292, "Може да доведе до сериозни проблеми от емоционален характер.", true, 73 },
                    { 293, "Изграждат реални емоционални връзки и задоволяват потребността от разбиране.", true, 74 },
                    { 294, "Предизвикват мигновено задоволство и гарантират социално одобрение.", false, 74 },
                    { 295, "Носят усещането за свързаност с много хора благодарение на социалните мрежи.", false, 74 },
                    { 296, "Създават емоции, породени от харесвания на лични постове в социалните мрежи.", false, 74 },
                    { 297, "През 2024 г. отговарянето на имейли бележи спад в сравнение с 2020 г.", false, 75 },
                    { 298, "През 2024 г. онлайн игрите в мрежата бележат ръст в сравнение с 2020 г.", false, 75 },
                    { 299, "През 2020 г. гледането на видео в мрежата бележи спад в сравнение с 2016 г.", true, 75 },
                    { 300, "През 2020 г. публикуването на съобщения бележи спад в сравнение с 2016 г.", false, 75 },
                    { 429, "за закъснялата слава на майстора", false, 108 },
                    { 430, "за творческата немощ на стария човек", false, 108 },
                    { 431, "за богоборческата дързост на твореца", false, 108 },
                    { 432, "за бездуховността на обществото", true, 108 },
                    { 433, "за забравата на героите", false, 109 },
                    { 434, "за поражението и позора", true, 109 },
                    { 435, "за смъртта и безсмъртието", false, 109 },
                    { 436, "за безкористната саможертва", false, 109 },
                    { 437, "се разкриват надеждите на селяните през трите сезона.", false, 110 },
                    { 438, "се представят утрото и приготовленията на семейството.", false, 110 },
                    { 439, "е пресъздадена самата стихия на безмилостната градушка.", true, 110 },
                    { 440, "са изобразени сломените надежди на страдащите хора.", false, 110 },
                    { 441, "„Дори да умирам, / живота със грубите / лапи челични / аз пак ще обичам!“", false, 111 },
                    { 442, "„Веднага ще кресна: / „Свалете! / Свалете! / По-скоро свалете / въжето, злодеи!“", false, 111 },
                    { 443, "„Летял бих / със пробна машина в небето, / бих влезнал във взривна / ракета ...“", true, 111 },
                    { 444, "„С живота сме в разпра, / но ти не разбирай, / че мразя живота.“", false, 111 },
                    { 445, "Представя удовлетворението на лирическия аз от пълноценното му съществуване.", false, 112 },
                    { 446, "Внушава ужаса на лирическия аз от досега му с външната действителност.", false, 112 },
                    { 447, "Откроява душевния драматизъм на лирическия аз в неспокойното му битие.", true, 112 },
                    { 448, "Разкрива вярата на лирическия аз в постигането на истинския смисъл на живота.", false, 112 },
                    { 449, "Както в „При Рилския манастир“, така и в „Градушка“ природата е враждебна към отрудения човек.", false, 113 },
                    { 450, "За разлика от „При Рилския манастир“ в „Градушка“ природата е стимул за творчество.", false, 113 },
                    { 451, "Както в „Градушка“, така и в „При Рилския манастир“ природата е географски конкретизирана.", false, 113 },
                    { 452, "За разлика от „Градушка“ в „При Рилския манастир“ природата е в хармония с човека.", true, 113 },
                    { 453, "във „Вяра“", false, 114 },
                    { 454, "в „Спасова могила“", true, 114 },
                    { 455, "в „До моето първо либе“", false, 114 },
                    { 456, "в „При Рилския манастир“", false, 114 },
                    { 457, "„Железният светилник“ и „Честен кръст“", false, 115 },
                    { 458, "„История“ и „Ноев ковчег“", true, 115 },
                    { 459, "„Борба“ и „Бай Ганьо журналист“", false, 115 },
                    { 460, "„Спи езерото“ и „История“", false, 115 },
                    { 461, "идеал – разочарование", false, 116 },
                    { 462, "любов – омраза", false, 116 },
                    { 463, "вечност – преходност", true, 116 },
                    { 464, "страст – безразличие", false, 116 },
                    { 465, "за грозотата и коварството на суровия живот", false, 117 },
                    { 466, "за напрегнатия двубой между човека и живота", true, 117 },
                    { 467, "за безсмислието на човешкото съществуване", false, 117 },
                    { 468, "за обречеността на всяко човешко усилие", false, 117 },
                    { 469, "Небивала суша изгаряше земята. Напеченият от слънцето град потъна в прах и миризми. („Крадецът на праскови“)", true, 118 },
                    { 470, "Ил кат орел надвесен / над бездните стоя и моят ум фъркат / блуждае в хаоса… („При Рилския манастир“)", false, 118 },
                    { 471, "Но мина зима снеговита, / отиде пролет дъждовита… („Градушка“)", false, 118 },
                    { 472, "Там едно бяло облаче бе се избързало над Витоша, а след него изскачаха, едно след друго, други по-малки и разпокъсани. („Ветрената мелница“)", false, 118 },
                    { 473, "Андрешко не може да прозре истинската природа на селяните.", false, 119 },
                    { 474, "Андрешко защитава селяните от нападките на съдия-изпълнителя.", true, 119 },
                    { 475, "Андрешко не разбира думите на съдията поради необразоваността си.", false, 119 },
                    { 476, "Андрешко търси начин да се подобри животът на селяните.", false, 119 },
                    { 477, "Очертават основното различие между българската и чуждестранната журналистика.", false, 120 },
                    { 478, "Разкриват политическите амбиции на Бай Ганьо да достигне до върховете на властта.", false, 120 },
                    { 479, "Представят угодническото ласкателство като стил на байганьовската журналистика.", true, 120 },
                    { 480, "Изразяват патриотичната насоченост на новосъздадения вестник „Народно величие“.", false, 120 },
                    { 481, "Както в „Песента на колелетата“, така и в „Балада за Георги Хених“ мисията на твореца е да придава смисъл на живота.", true, 121 },
                    { 482, "За разлика от „Песента на колелетата“ в „Балада за Георг Хених“ творческият труд е осмислен като благо за другите.", false, 121 },
                    { 483, "Както в „Песента на колелетата“, така и в „Балада за Георг Хених“ творческият труд остава неоценен от другите.", false, 121 },
                    { 484, "За разлика от „Песента на колелетата“ в „Балада за Георг Хених“ вдъхновението на твореца се поддържа от любовта.", false, 121 },
                    { 485, "„Спасова могила“", false, 122 },
                    { 486, "„Две души“", false, 122 },
                    { 487, "„Потомка“", true, 122 },
                    { 488, "„Спи езерото“", false, 122 },
                    { 489, "Подсказва идеята за страдалческото съществуване.", false, 123 },
                    { 490, "Разкрива спасителната сила на словото и вярата.", true, 123 },
                    { 491, "Откроява живота като пребиваване в света на сенките.", false, 123 },
                    { 492, "Загатва идеята за преходността на човешкия живот.", false, 123 },
                    { 493, "във „Ветрената мелница“", false, 124 },
                    { 494, "в „Песента на колелетата“", false, 124 },
                    { 495, "в „Честен кръст“", true, 124 },
                    { 496, "във „Вяра“", false, 124 },
                    { 497, "„Железният светилник“ и „Балкански синдром“", false, 125 },
                    { 498, "„Потомка“ и „Песента на колелетата“", false, 125 },
                    { 499, "„Новото гробище над Сливница“ и „Ноев ковчег“", true, 125 },
                    { 500, "„Честен кръст“ и „Две души“", false, 125 },
                    { 821, "за природата", false, 206 },
                    { 822, "за труда и творчеството", false, 206 },
                    { 823, "за живота и смърт", true, 206 },
                    { 824, "за раздвоението", false, 206 },
                    { 825, "природата", false, 207 },
                    { 826, "животът и смъртта", true, 207 },
                    { 827, "раздвоението", false, 207 },
                    { 828, "трудът и творчеството", false, 207 }
                });

            migrationBuilder.InsertData(
                table: "Passages",
                columns: new[] { "Id", "Content", "ExamSessionId", "ImagePath", "Number" },
                values: new object[,]
                {
                    { 5, "Спортните занимания са важен фактор за постигане на добро физическо и психическо здраве. Според данните на Световната здравна организация при хората, които спортуват поне 150 минути седмично, има значително по-нисък риск от хронични заболявания и преждевременна смърт. Въпреки това заниманията със спорт имат и своите предизвикателства. Много специалисти предупреждават, че неправилната техника на изпълнение на упражненията, 3 прекомерното натоварване и омаловажаването на възстановителните периоди могат да доведат до сериозни травми. Скорошно изследване сочи, че около 30% от редовно спортуващите получават травми, които са резултат от липсата на загряване преди тренировка. Според експертите по спортна медицина съревнованието с другите спортуващи в залата често подтиква хората да надценяват възможностите си, което увеличава риска от дълготрайни увреждания. Съществуват и някои погрешни схващания около спортуването. Широко разпространено например е мнението, че тичането може да се практикува от всички. Ако човек обаче е с тегло дори и малко над нормата, рискът от травми е много по-голям. При бягане ставите на краката трябва да издържат на натоварване, което се равнява на утроеното собствено тегло. Друго разпространено схващане е, че разходката не е спорт. Данни от изследване обаче свидетелстват, че четири кратки разходки на ден са по-полезни от продължителен джогинг както за кръвообрaщението и работата на сърцето, така и за намаляването на високото кръвно налягане. Доказано е също така, че ако се изминават пеша кратки отсечки от по един километър, проблемите със съня намаляват наполовина. Танцуването пък се оказва, че е едно от най-ефективните и същевременно найполезните за гърба спортни занимания. Гръбначните мускули се стабилизират, а тялото изгаря за час танцуване около 600 килокалории. Редовните занимания с танци намаляват със 76% риска от деменция, сочи изследване. Народните танци например не само укрепват здравето – те съхраняват и културната идентичност чрез връзката с фолклора и обичаите. Някои експерти смятат обаче, че спортуването е само една част от здравословния начин на живот. Според повечето диетолози правилното хранене и качественият сън са не по-малко важни. Физическата активност може да подобри здравето, но без балансиран хранителен режим и без достатъчно почивка усилията може да бъдат напразни.", 3, null, 1 },
                    { 6, null, 3, "/images/texts/text2025M.png", 2 },
                    { 7, "Изглежда, че надпреварата за клиенти между големите търговски вериги и малките квартални магазинчета завърши с победа на... онлайн пазаруването. Инвестициите в електронната търговия стават все по-големи. Търговците я предпочитат заради по-ниските разходи, тъй като нямат нужда от продавачи, могат да съхраняват стоката си на едно място, а и в повечето случаи доставката е за сметка на потребителя. При условие че изградят добра политика за дистрибуция, търговците ще могат да извличат ползи от онлайн пазаруването дълго време. „Око да види, ръка да пипне“ – това пък е основният аргумент на българина срещу пазаруването онлайн. За българския потребител през последните години обаче този довод отстъпва пред множеството предимства на пазаруването по интернет. С други думи, няма значение къде се намира човек – всичко може да се поръча онлайн по всяко време на денонощието. Интернет търговията предлага по-голямо разнообразие от стоки. Пести се време, като не се пътува до търговския обект и не се търси място за паркиране, а и отпада носенето на тежки торби. Много магазини правят промоционалните си оферти в онлайн среда, поради което пазаруването там е доста по-икономично за клиента. Повечето сайтове имат филтри за търсене, благодарение на които бързо могат да се открият най-изгодните оферти. Наред с това последните промени в Закона за защита на потребителите правят пазаруването онлайн по-сигурно от традиционното, регламентират сроковете за връщане на закупена стока и за възстановяване на парите по банков път. 3 Tвъpди cе, чe пaзapyвaнeтo oнлaйн e пo-eĸoлoгичнo. Но всъщност транспортирането нa cтoĸитe oт paзлични дистрибуторски цeнтpoвe, пакетирането им в допълнителни опаковки и доставянето им до клиента също генерират вpeдни eмиcии и oтпaдъци. Ocвен това мнoгo чecтo c eднa пopъчĸa се доставят caмo пo една-две стоки. Пo-eĸoлoгичният нaчин зa пaзapyвaнe мoжe дa ce oĸaжe тpaдициoннoтo посещение на търговски обект, когато с едно пътуване хората обикновено купуват много стоки наведнъж. Има няколко oтгoвopа нa въпpoca какво представлява екологичното пазаруване, и xoдeнeтo пeш дo мaгaзина e eдин oт тях. Ако се налага използването на пpeвoзнo cpeдcтвo, найподходящи са общественият транспорт и електромобилът. Затова и гoлeмитe тъpгoвcĸи цeнтpoвe инcтaлиpaт зapядни cтaнции зa електромобили на cвoитe пapĸинги, за да нacъpчaвaт екологичното пaзapyвaнe.", 4, null, 1 },
                    { 8, null, 4, "/images/texts/text2025A.png", 2 },
                    { 9, "Рекламата е навлязла дълбоко в живота ни. Добра или лоша – тя ни информира, променя поведението ни и влияе върху нашите естетически нагласи. Първите реклами се свързват с разгласяваните от глашатаи съобщения за предстоящи гладиаторски борби в Древния Рим. По-късно с устно разпространяване на рекламни послания се занимават проповедници, търговци и фокусници. Рекламата ни кара да преживяваме света като по-емоционален, по-малко рисков, по-красив; стреми се да стимулира нашето асоциативно мислене, но невинаги успява. Добрата реклама ни подтиква да търсим „скритата картинка“, дълбокия смисъл на думите и изображенията. Неслучайно в създаването на реклами участват и семиотици, и 3 психолози, които прилагат на практика теоретичните си знания и спомагат за поставянето на съвременната реклама на научни основи. По този начин рекламата съдейства да опознаем по-добре себе си. Без съмнение рекламата е продукт, но и „продуцент“. Тя може както да забавлява, така и да бъде досаден натрапник. Затова и рекламната индустрия е от най-критикуваните. Основното обвинение спрямо рекламата е, че изкривява истината. Съвременният човек обаче трудно може да си представи свят без постоянни предложения и настойчиви подкани за покупки. Сред главните причини да се гледа с лошо око на рекламата, са твърде дългите рекламни блокове в телевизионния праймтайм (най-гледаното време от 19:00 до 24:00 ч.), големият брой маркетингови имейли и изскачащите от различни уебсайтове рекламни предложения. Зрители от целия свят се оплакват заради честите внезапни прекъсвания на най-гледаните телевизионни предавания. Тази практика предизвиква неприятни емоции, защото се спира зрителското съпреживяване, а връщането към него е сякаш след цяла вечност. Рекламата не ни стимулира да мислим критично – тя ни дава готови отговори, готови рецепти, готови образи, готови модели на поведение. Често ние дори не я разпознаваме, когато е мимикрирала като продуктово позициониране в най-гледаните предавания и сериали. Чрез рекламата често се създават митове и се показват нереалистични социални практики.", 5, null, 1 },
                    { 10, null, 5, "/images/texts/text2024M.png", 2 },
                    { 11, "Доказателствата, че климатът на планетата се променя, вече са очевидни за всеки от нас. Най-същественото от тях е повишението на температурата както на въздуха, така и на водата в Световния океан. Ако се вземе средната температура за периода от 1850 г. до 1900 г. и се сравни със средната температура през 2020 г., разликата от 1,2С на пръв поглед изглежда незначителна. Тук обаче трябва да се обърне внимание, че това увеличение не е равномерно по цялата планета. Например в Швейцария то е над два градуса главно заради топенето на ледниците, докато напр. в Аляска повишението достига вече 8 – 10 градуса. 10. В листа за отговори запишете правилната за изречението форма на думата, поставена в скоби. От едната страна на хълма имаше опасни (сипей). 3 Липсата на достатъчно научни знания – най-вече за Световния океан, покриващ 70% от повърхността на Земята, както и за криосферата (част от която са например вечнозамръзналите територии на Арктика) и за т.нар. „трети полюс“ (Тибетското плато) – е удобно извинение за всички, които отказват да се отнесат сериозно към климатичните промени. Факт е обаче ускореното темпо, с което се променя климатът, както – според редица авторитетни учени – e неоспорима и взаимовръзката между начина на живот на хората и глобалното затопляне. Научен доклад описва как последиците от климатичните промени ще се отразят на моретата и вечнозамръзналите региони – две системи, от които пряко или косвено зависи животът на всички ни. Днес вече се знае, че и дълбините на моретата се затоплят, че топенето на ледените шапки на полюсите се отразява на времето в Африка и тропическите региони. Известно е, че изчезването на глетчерите застрашава запасите от питейна вода и повишава киселинността на океаните. Знае се също, че нивото на моретата и океаните се увеличава по-бързо от очакваното. Вече е ясно, че не само някои малки островни държави могат да изчезнат от картата на света – могат да потънат и някои световни мегаполиси по крайбрежията. Прекалено дълго хората оправдават своето бездействие. Нима не можем да караме по-малко автомобилите си, да летим по-рядко със самолети, да се променим по-осъзнато, да се обърнем решително към възобновяемите енергийни източници? Решения съществуват. Какво още трябва да се случи, за да се убедят хората от богатите индустриални държави, че дните на днешния разточителен начин на живот са преброени? Ако искаме да спрем глобалните климатични промени и да спасим нашата планета, трябва да променим начина си на живот.", 6, null, 1 },
                    { 12, null, 6, "/images/texts/text2024A.png", 2 },
                    { 13, "Ян Вацлав Мърквичка е чешки художник, когото българите дотолкова обикват, че започват да го наричат „българския чех“. Двадесет и пет годишният чешки живописец и педагог пристига през 1881 г. в Пловдив по покана на правителството на Източна Румелия, а това е времето, за което казват: „Нямаше нищо, а трябваше всичко“. През същата година Мърквичка започва работа като учител по рисуване в Пловдив и има 3 изключителни заслуги за утвърждаването на рисуването по натура като учебен метод в българското училище. Той е първият, който обучава в тънкостите на рисувателните техники и момичета – нещо непознато дотогава даже в Германия. След Съединението, вече в София, Мърквичка развива активна творческа и обществена дейност. Когато през 1896 г. се създава Държавното рисувално училище (днешната Национална художествена академия), негов пръв директор става Мърквичка и училището бързо печели име и извън страната. Той помага за подготовката на много български художници и за регламентирането на професията на художника. Мърквичка твори в почти всички жанрове на живописта – битов, исторически, портретен, пейзажен, натюрморт. Създава забележителни творби, сред които картината „Ръченица“. На нея е изобразен ирландският журналист и кореспондент на в. „Таймс“ Джеймс Баучер, който играе ръченица в една кръчма. Запознанството на двамата чужденци е случайно, но оставя трайна следа – след картината започват да наричат Баучер „ирландеца с българско сърце“. В автобиографията си художникът споделя любопитни факти, свързани с народопсихологията на тогавашния българин. „Не беше възможно да се намери човек да позира“ – спомня си художникът. Предразсъдъците и суеверието за вещаещо гибел „зазиждане“ са сериозна пречка за създаването на студийни рисунки не само на хора, но и на животни. А без модели не е възможно да се създаде живописна композиция, изобразяваща реалистично обичаите и носиите ни – тема, обикната от Мърквичка. „Вървях ли по улицата – разказва той – често се спирах и скрит, за да не ме види някой, рисувах интересен сюжет. Случи ми се веднъж да рисувам магаре: щом неговият стопанин ме видя, веднага го отведе, за да не го урочасам.“", 7, null, 1 },
                    { 14, null, 7, "/images/texts/text2023M.png", 2 },
                    { 15, "Ако попитаме един средностатистически млад човек, за когото културните удоволствия се свеждат най-вече до попконцертите и дискотеките, влизал ли е в оперна зала, той най-вероятно би ни се изсмял. Би обяснил, че смята операта за старомоден жанр, в който всичко е приповдигнато и преувеличено и в който „нормалната“ човешка реч е заменена с пеене. Как да си обясним тогава, че операта и през 21. век все още привлича публика от всички части на планетата? Любопитен е фактът, че след Втората световна война западният авангард изцяло отхвърля операта (както и класическата музика изобщо) като „буржоазно изкуство“, вследствие на което 30 години не се появява нито една опера. Но от края на миналия век и до днес този жанр преживява истински бум не само сред новите, но и сред по-старите поколения композитори. Какво кара хората да си купят билет за опера и търпеливо да чакат дори и няколко години, за да съпреживеят любимите си арии на някоя от световните оперни сцени? Или да се тълпят вечер преди самото представление пред касите – без значение колко висока е цената на билетите – с надеждата по щастлива случайност да си осигурят един билет? Операта не понася подражанието на действителността и дребнотемието. Действителността в нея е пречупена през вълшебно огледало или е погледната сякаш от друга планета. Затова всичко в операта изглежда преувеличено и приповдигнато, тъй като тя има свойството не толкова да извежда на преден план самия сюжет, колкото да създава неповторима атмосфера.", 8, null, 1 },
                    { 16, "– Как гледате на опитите днес да се смесват оперни гласове с попмузика? \r\n– Аз съм твърде много музикант, за да приема такъв „търговски“ подход. Зная, че живеем в света на телевизията, на високите технологии. Аз не съм правила никога компромис, а подобно смесване на жанровете е компромис. Смятам, че влезе ли в друг жанр, оперният певец става смешен. Ние, оперните певци, имаме съвсем друга гласова постановка, най-важното – естетиката ни е друга. Нямаме вкус към „леката“ музика. Затова такива опити ми изглеждат доста абсурдни. \r\n– Смятате ли, че интернет поколението има това специфично музикално чувство, което е характерно за операта? \r\n– Аз самата не съм от това поколение. Наистина всичко се променя, но смятам, че културата трябва да се съхрани. Човекът има потребност от изкуството, а не само от компютъра и от цифрите. Ние, по-старите, трябва да предадем своя опит на младото поколение, да му внушим, че оперното изкуство възвисява духа. Не само компютрите правят живота. \r\n– Какво ще стане с операта през нашия век? Ще „мутира“ ли под влиянието на съвременните технологии, или ще остане островче на чисто човешкото?\r\n – Ако нашата цивилизация оживее, ще оживее и операта, ако загине... Но аз се надявам, че цивилизацията ни няма да загине. Питала съм се как ще повлияят технологиите на операта. Само преди месец чух един концерт със съвременна музика, в който всичко беше направено от компютри. И хорът беше направен от компютър. Машината няма дух, няма мозък, няма емоция, а човекът има чувства, има и душà. Затова операта винаги ще се прави от живи хора.", 8, null, 2 },
                    { 17, "– Как можем да мотивираме децата да четат самостоятелно в дигиталната ера? \r\n– На първо място бих препоръчала да започнем да четем на децата от най-ранна възраст. Аз съм дълбоко убедена, че това е важно – не в смисъла на научаване или усвояване на знания, а най-вече за укрепване на връзката между родител и дете и след това за превръщането на книгата в естествена част от ежедневието на детето. На по-следващ етап е важно да четем на детето с артистичен и изразителен глас – особено когато то започне да разбира повече. И 3 последното нещо – но не и на последно място – е личният пример. Когато детето вижда родителите си да четат не по задължение, а защото това им е приятно и им носи положителни емоции, е по-вероятно и то самото да прояви по-голям интерес към четенето. Според мен не е добра идея да насилваме децата да четат нещо, към което нямат интерес. Това важи най-вече за периода, когато самостоятелно започват да четат. Тогава е много важно да ги оставим сами да избират това, което е интересно за тях. \r\n– Какви според Вас са основните ползи от четенето за развитието на децата?\r\n – Често си мисля какво пък толкова ще стане, ако децата не четат. Преди време се е казвало: „Хайде, вземи свърши малко работа, само четеш“, което ми напомня на днешното: „Хайде, вземи прочети нещо, само гледаш в този таблет“. Четенето има много достойнства, но на мен най-вече ми харесва това, че докато четеш, се превръщаш в съавтор и активен участник в този процес. Тоест не си само пасивен получател на информация. \r\nАз съм напълно убедена, че ако има един милион души, които четат един и същ роман, всеки от тях в съзнанието си вижда различна картина. Докато очите четат, мозъкът преработва информацията, фантазията рисува по неповторим начин. За мен това е страхотна тренировка за ума и за въображението. \r\nАз харесвам също и филмите, те са прекрасен вид творчество, но там виждаш как изглежда даден герой, а при четенето всеки може да си го представи различно. Четенето вече не е просто източник на информация, дори вече не смятам, че то има основна роля за подобряването на правописа и правоговора. То е преди всичко инструмент, с който запазваме и развиваме въображението си. \r\nИ нещо изключително важно – особено що се отнася до деца – четенето не изморява, не изтощава и не насилва сетивата по начина, по който го правят филмите или компютърните игри.", 9, null, 1 },
                    { 18, null, 9, "/images/texts/text2022M.png", 2 },
                    { 19, "Бащите на Френската революция издигат като основни принципи в междуличностните и обществените отношения свободата, братството и равенството. Заедно тези три думи звучат красиво като идеал. Но на практика са несъвместими принципи – ако има свобода, няма равенство. Ако ли пък има равенство, няма свобода, защото със сила се налага равенството. А когато нещо е наложено със сила, за какво братство може да се говори? Идеологически обаче тези три думи вършат прекрасна работа и до днес. \r\nВпрочем още тогава, само четири години след щурма на Бастилията, това триединство е потъпкано по време на якобинската диктатура начело с Максимилиан Робеспиер и терора на якобинците, довел до гибелта на 30 хиляди души чрез гилотиниране. 3 Самият Робеспиер – един от бащите на революцията, на свой ред също намира края си на гилотината и така се ражда прозрението, че „революцията изяжда децата си“. \r\nФренската революция е дала своя значим принос за днешната демокрация. За пръв път в Европа биват обявени за неприкосновени гражданските и човешките права чрез Декларацията за правата на човека и гражданина. За пръв път се изработва и приема демократичен основен закон, или конституция, която пък предписва като основен принцип разделението на властите – законодателна, изпълнителна и съдебна. Полага се и началото на многопартийната система. Изключителен акт е и отделянето на църковната от светската власт – нещо немислимо дотогава. Новости има и в областта на правото – приема се Френският граждански кодекс, или т.нар. Наполеонов кодекс, който има огромно въздействие върху гражданското право и до днес.", 10, null, 1 },
                    { 20, "На едни им е додеяло от революции, други се чувстват окрилени от революционния кипеж. Революциите са двуостър меч. Те не оставят място за неутралитет – едни са окрилени, на други крилата са подрязани. \r\nРеволюциите винаги дават неизпълними обещания. Били сме щели да бъдем свободни, били сме щели да станем като нормалните държави – да пътуваме, да търгуваме, да печелим, да забогатяваме, да пишем и да говорим каквото си искаме, несправедливостите да се махнат, законността да се възцари. И още, и още… Стига толкова, стига! Едни са измамени, други са спечелили, трети са спечелили много. \r\nПреживяхме много революции, но свободни не станахме. И не знаем къде да търсим причината – дали в революциите, дали в тяхната недостатъчност. Някой ни беше внушил, че революциите раждат свобода, че свободата се извоюва с революция. Може някъде и да е така, но у нас не е. Различните народи правят различни революции. Но различните народи по различен начин постигат свободата си и не е задължително да е винаги с революция. То затова народите са различни – едни успяват, други се провалят. Тези, които се провалят, обикновено обвиняват за своя провал успелите. А причината за провала, независимо дали обществен, или личен, е винаги вътре. Дори когато един организъм се заразява с вирус отвън, причината пак е в него, в слабата му способност за защита. Защото други организми устояват на същия вирус. А провалените търсят кой ги е заразил, вместо да усилят защитата си. Да погледнат навътре, не могат. Поглеждането навътре би било за тях проглеждане, но те си остават слепи. После компенсират тази слепота с излишък от самочувствие и с геройско изтъкване. Сякаш другите народи нямат велики герои, бляскави победи и славна история. Сякаш само ние на света сме най-първи във всичко. Само дето всичката ни слава е все в миналото – далечно и близко, но с което ние сякаш сме скъсали генетичната си връзка и изглежда, че не сме го наследили реално. Потомци сме на лъвове, а постъпваме като мишки. \r\nИз „Есе за революциите“, Т. Димова (адаптиран откъс)", 10, null, 2 }
                });

            migrationBuilder.InsertData(
                table: "QuestionPassages",
                columns: new[] { "PassageId", "QuestionId" },
                values: new object[,]
                {
                    { 1, 68 },
                    { 2, 68 },
                    { 3, 72 },
                    { 4, 72 }
                });

            migrationBuilder.InsertData(
                table: "Questions",
                columns: new[] { "Id", "Content", "ExamSessionId", "QuestionTypeId" },
                values: new object[,]
                {
                    { 13, "В кой ред думата е изписана правилно?", 6, 1 },
                    { 14, "В кое изречение е допусната правописна грешка?", 6, 1 },
                    { 15, "В кое изречение НЕ е допусната правописна грешка?", 6, 1 },
                    { 16, "В кой ред думата е изписана правилно?", 7, 1 },
                    { 17, "В кое изречение НЕ е допусната правописна грешка?", 7, 1 },
                    { 18, "В кое изречение е допусната правописна грешка?", 7, 1 },
                    { 19, "В кой ред думата е изписана правилно?", 8, 1 },
                    { 20, "В кое изречение е допусната правописна грешка?", 8, 1 },
                    { 21, "В кое изречение е допусната правописна грешка?", 8, 1 },
                    { 22, "В кой ред думата е изписана правилно?", 9, 1 },
                    { 23, "В кое изречение НЕ е допусната правописна грешка?", 9, 1 },
                    { 24, "В кое изречение е допусната правописна грешка?", 9, 1 },
                    { 25, "В кой ред думата е изписана правилно?", 10, 1 },
                    { 26, "В кое изречение е допусната правописна грешка?", 10, 1 },
                    { 27, "В кое изречение НЕ е допусната правописна грешка?", 10, 1 },
                    { 32, "В кое изречение НЕ е допусната граматична грешка?", 3, 2 },
                    { 33, "В кое изречение е допусната граматична грешка?", 3, 2 },
                    { 34, "В кое изречение НЕ е допусната граматична грешка?", 4, 2 },
                    { 35, "В кое изречение е допусната граматична грешка?", 4, 2 },
                    { 36, "В кое изречение е допусната граматична грешка?", 5, 2 },
                    { 37, "В коя от подчертаните думи е допусната граматична грешка? Госпожо Иванова, бихте ли ни разказала (", 5, 2 },
                    { 38, "В кое изречение е допусната граматична грешка?", 6, 2 },
                    { 39, "В кое изречение НЕ е допусната граматична грешка?", 6, 2 },
                    { 40, "В коя от подчертаните думи е допусната граматична грешка? В изявлението му (", 7, 2 },
                    { 41, "В кое изречение НЕ е допусната граматична грешка?", 7, 2 },
                    { 42, "В кое изречение НЕ е допусната граматична грешка?", 8, 2 },
                    { 43, "В кое изречение е допусната граматична грешка?", 8, 2 },
                    { 44, "В кое изречение е допусната граматична грешка?", 9, 2 },
                    { 45, "В коя от подчертаните думи е допусната граматична грешка?\r\n В Министерство (", 9, 2 },
                    { 46, "В кое изречение НЕ е допусната граматична грешка?", 10, 2 },
                    { 47, "В кое изречение е допусната граматична грешка?", 10, 2 },
                    { 52, "В кое изречение е допусната пунктуационна грешка?", 3, 3 },
                    { 53, "В кое изречение НЕ е допусната пунктуационна грешка?", 3, 3 },
                    { 54, "В кое изречение е допусната пунктуационна грешка?", 4, 3 },
                    { 55, "В кое изречение е допусната пунктуационна грешка?", 4, 3 },
                    { 56, "В кое изречение е допусната пунктуационна грешка?", 5, 3 },
                    { 57, "В коя от позициите, означени с букви, е допусната пунктуационна грешка? Психолозите съветват, че за да живеем спокойно и щастливо, (", 5, 3 },
                    { 58, "В кое изречение е допусната пунктуационна грешка?", 6, 3 },
                    { 59, "В кое изречение е допусната пунктуационна грешка?", 6, 3 },
                    { 60, "В кое изречение е допусната пунктуационна грешка?", 7, 3 },
                    { 61, "В кое изречение НЕ е допусната пунктуационна грешка?", 7, 3 },
                    { 62, "В кое изречение е допусната пунктуационна грешка?", 8, 3 },
                    { 63, "В кое изречение е допусната пунктуационна грешка?", 8, 3 },
                    { 64, "В кое изречение е допусната пунктуационна грешка?", 9, 3 },
                    { 65, "В кое изречение НЕ е допусната пунктуационна грешка?", 9, 3 },
                    { 66, "В кое изречение е допусната пунктуационна грешка?", 10, 3 },
                    { 67, "В коя от позициите, означени с букви, е допусната пунктуационна грешка? Докато обмислях (", 10, 3 },
                    { 76, "Кое е вярно за спортуването според Текст 1?", 3, 4 },
                    { 77, "Кое НЕ е фактор, водещ до сериозни травми в спорта, според Текст 1?", 3, 4 },
                    { 78, "Кое е вярното твърдение според Текст 2?", 3, 4 },
                    { 79, "Какъв извод може да бъде направен според информацията в Текст 2?", 3, 4 },
                    { 80, "Кое НЕ е вярно за електронната търговия според Текст 1?", 4, 4 },
                    { 81, "В Текст 1 се защитава позицията, че:", 4, 4 },
                    { 82, "Коя информация за онлайн пазаруването НЕ се потвърждава в нито един от двата текста?", 4, 4 },
                    { 83, "Кое твърдение НЕ е вярно според информацията в Текст 2?", 4, 4 },
                    { 84, "Кое е вярно за рекламата според Текст 1?", 5, 4 },
                    { 85, "Какво означава подчертаният израз в Текст 1?", 5, 4 },
                    { 86, "На основата на информацията от Текст 2 може да бъде направен следният извод:", 5, 4 },
                    { 87, "Според данните от Текст 2 е вярно, че:", 5, 4 },
                    { 88, "Къде според Текст 1 промяната на температурата е най-значителна?", 6, 4 },
                    { 89, "Според Текст 1 хората:", 6, 4 },
                    { 90, "Какъв извод може да се направи от информацията в Текст 1 и Текст 2?", 6, 4 },
                    { 91, "Кое твърдение е вярно според информацията в Текст 2?", 6, 4 },
                    { 92, "Кое твърдение е вярно според информацията в Текст 1?", 7, 4 },
                    { 93, "Кое твърдение за Ян Мърквичка НЕ е вярно според информацията в Текст 1?", 7, 4 },
                    { 94, "Защо според Текст 1 е било невъзможно да се намерят хора да позират?", 7, 4 },
                    { 95, "Кое е НЕВЯРНОТО твърдение според информацията в Текст 2?", 7, 4 },
                    { 96, "Защо според Текст 1 всичко в операта изглежда приповдигнато и преувеличено?", 8, 4 },
                    { 97, "В Текст 1 се защитава позицията, че:", 8, 4 },
                    { 98, "Защо подчертаното изречение в Текст 2 завършва с многоточие?", 8, 4 },
                    { 99, "Кое противопоставяне НЕ присъства в нито един от двата текста?", 8, 4 },
                    { 100, "Защо според Текст 1 родителите трябва да четат на децата си от най-ранна възраст?", 9, 4 },
                    { 101, "Коя от посочените позиции се оспорва в Текст 1?", 9, 4 },
                    { 102, "Какъв извод може да се направи от думите на интервюираната в Текст 1?", 9, 4 },
                    { 103, "Каква е връзката между четенето на различни текстове и резултатите по четивна грамотност според диаграмата?", 9, 4 },
                    { 104, "Защо според Текст 1 принципите на Френската революция – свободата, братството и равенството, „на практика са несъвместими“ помежду си?", 10, 4 },
                    { 105, "В Текст 2 се заявява, че:", 10, 4 },
                    { 106, "Какъв извод за революциите може да се направи въз основа на Текст 1?", 10, 4 },
                    { 107, "Коя опозиция съответства на смисъла на израза от Текст 2: „едни са окрилени, на други крилата са подрязани“?", 10, 4 },
                    { 126, "Кой конфликт е заложен в интерпретацията на темата за човека и властта в „Андрешко“?", 3, 5 },
                    { 127, "Кой от проблемите е интерпретиран и в двата посочени откъса? \r\n„Сто двадесет души те бяха на брой. \r\nИ паднаха всички при първия бой! \r\nСо залп ги посрещна на родния бряг в засада отрано приготвений враг. \r\nУмряха те всички за родния край...“ (П. П. Славейков, „Сто двадесет души“)\r\n\r\n„Българийо, за тебе те умряха, \r\nедна бе ти достойна зарад тях \r\nи те за теб достойни, майко, бяха! \r\nИ твойто име само кат мълвяха, \r\nумираха без страх.“ (Ив. Вазов, „Новото гробище над Сливница“)", 3, 5 },
                    { 128, "Кой от мотивите НЕ е интерпретиран в „Бай Ганьо журналист“?", 3, 5 },
                    { 129, "Заглавието „Две души“ в контекста на творбата препраща към:", 3, 5 },
                    { 130, "В кой от цитатите се открива страдалческото примирение в „Градушка“?", 3, 5 },
                    { 131, "Кое от твърденията за откъса от „Крадецът на праскови“ е НЕВЯРНО?\r\n„ Постепенно липата бе станала за нея живо същество и тя я гледаше отдалеч с весел поглед, както се гледа мълчалив и верен съучастник… (...) …Само колибата, нейният дом, не бе докосната от възраждащата и обновяваща сила. Тя изглеждаше още по-мрачна, някак отминала, досадна и стара, като напуснат затвор. Тя прекарваше в колибата малко часове през деня, изправена пред огледалото, където се разглеждаше със себепоказваща и кокетлива стойка на влюбена жена. (...) Огледалото я вълнуваше и я възбуждаше, тя отиваше вън да погледне липата и приветливо да ѝ кимне с глава.“", 3, 5 },
                    { 132, "Кое твърдение е вярно?", 3, 5 },
                    { 133, "Кое твърдение съответства на смисъла на творбата „Вяра“?", 3, 5 },
                    { 134, "Сляпото подчинение на властови фигури присъства в:", 3, 5 },
                    { 135, "В кои две творби любовта е представена като преобразяваща сила?", 3, 5 },
                    { 136, "Кой конфликт е заложен в интерпретацията на темата за човека и природата в „Градушка“?", 4, 5 },
                    { 137, "Кой от проблемите е интерпретиран и в двата посочени откъса? \r\n„И е човек с добро сърце: / не оставя сиромаси; / но не той вас, братя, храни, / а вий него със труда си!“ (Хр. Ботев, „Патриот“) \r\n„Богат е“, казва, пък го не пита / колко е души изгорил живи, / сироти колко той е ограбил / и пред олтаря бога измамил...“ (Хр. Ботев, „Борба“)", 4, 5 },
                    { 138, "Като развръзка в „Андрешко“ може да се определи:", 4, 5 },
                    { 139, "Кое от тълкуванията съответства на смисъла на творбата „Спасова могила“?", 4, 5 },
                    { 140, "Какво подсказват за Сали Яшар мислите му? „Джапар отминава нататък. Сали Яшар тръгва към къщи, гледа светлите петна, които трептят като жълтици в сянката на салкъмите, и мисли за това, което всяка вечер му иде наум, защото всяка вечер Джапар минава оттук и му се обажда. Джапар е беден, но добър момък; преди години той поиска дъщеря му, но тя не го рачи. (…) И тая вечер, като го виждаше как отминава в тъмнината и как свети цигарата му, той си мислеше, че у него все е останало нещо от миналото, че в душата му още гори рана, както гори цигарата му в мрака.“", 4, 5 },
                    { 141, "Кое от твърденията за цитирания откъс от „При Рилския манастир“ е вярно? \r\n„Сега съм у дома, сега съм пак поет – \r\nвъв лоното на таз пустиня горска, свята; \r\nразбирам на леса любовний тих привет, \r\nна струите шума, на бездната мълвата.“", 4, 5 },
                    { 142, "Кое твърдение е вярно?", 4, 5 },
                    { 143, "Кое от тълкуванията съответства на смисъла на творбата „Две души“?", 4, 5 },
                    { 144, "Коя творба представя труда като израз на естествена човешка потребност?", 4, 5 },
                    { 145, "Кои две творби утвърждават народностното самосъзнание като ценност?", 4, 5 },
                    { 146, "Кой проблем е заложен в интерпретацията на темата за вярата и надеждата в „Спасова могила“?", 5, 5 },
                    { 147, "Кой от проблемите е интерпретиран и в двата посочени откъса? \r\n„О, как се люшкахме в надеждите!... \r\nА тегнеше небето ниско, \r\nсвистеше въздухът нажежен… \r\nНе мога повече! Не искам!...“ (Н. Вапцаров, „История“) \r\n\r\n„И в това царство кърваво, грешно, \r\nцарство на подлост, разврат и сълзи, \r\nцарство на скърби – зло безконечно! \r\nкипи борбата и с стъпки бързи\r\n върви към своят свещени конец... \r\nЩе викнем ние: „Хляб или свинец!“ (Хр. Ботев, „Борба“)", 5, 5 },
                    { 148, "Кой от мотивите е интерпретиран във „Вяра“?", 5, 5 },
                    { 149, "Какво внушават думите на Бай Ганьо: Че голям мурафет ли е един вестник да се издава?", 5, 5 },
                    { 150, "В кой от цитатите от разказа „Песента на колелетата“ е разкрито прозрението на героя за смисъла на житейското му призвание?", 5, 5 },
                    { 151, "Кое от твърденията за цитирания откъс от „Паисий“ е вярно? \r\n„…във скромна килийка, потънала в сън,\r\n един монах тъмен, непознат и бледен \r\nпред лампа жумеща пишеше наведен.“", 5, 5 },
                    { 152, "Кое от твърденията е вярно?", 5, 5 },
                    { 153, "Кое твърдение съответства на смисловите внушения на „До моето първо либе“?", 5, 5 },
                    { 154, "Унищожителната сила на войната е представена в:", 5, 5 },
                    { 155, "Кои две творби представят творческия труд като осмислящ живота?", 5, 5 },
                    { 156, "Кой проблем НЕ е заложен в интерпретацията на темата за обществото в „Балкански синдром“?", 6, 5 },
                    { 157, "Кой от проблемите е интерпретиран и в двата посочени откъса? \r\n„И днес йощ Балканът, щом буря зафаща, \r\nспомня тоз ден бурен, шуми и препраща \r\nславата му дивна като някой ек \r\nот урва на урва и от век на век!“ (Ив. Вазов, „Опълченците на Шипка“) \r\n„Но кой ви знай, че спите в тез полета? \r\nНад ваший гроб забвеньето цъфти. \r\nКои сте вий? Над сянката ви клета \r\nне мисли никой днес освен поета\r\n и майките свети.“ (Ив. Вазов, „Новото гробище над Сливница“)", 6, 5 },
                    { 158, "Кой от мотивите е интерпретиран в „Бай Ганьо журналист“?", 6, 5 },
                    { 159, "Кое твърдение за думите на Рафе Клинче от „Железният светилник“ е вярно? \r\n„Птичките пеят, зреят гроздовете… Душата ми е в това дърво. (…) Виждаш ли, погледни! По това ще ни познават людете некога, ще ни знаят…“", 6, 5 },
                    { 160, "Прочетете встъпителните думи на повествователя от началната глава на романа на Йордан Радичков и посочете какво го провокира да построи своя ноев ковчег. \r\n„Въпреки това ден из ден започва да ме преследва натрапчивата идея и манията, че аз, подобно на библейския Ной, ще трябва да събера не само мизерията на своя живот, но и цялата мизерия и величественост на този въшкав живот, дето го живеем с вас, мили ми четецо! (…) И тъй, нагърбвам се със задачата да продължа по-нататък, като започна отново да сковавам бедния плавателен съд и лека-полека да пълня трюма му. Нямам никакви шансове за успех, но при всеки случай си казвам окуражително: „Хайде, удавнико, на добър час!“(…)“", 6, 5 },
                    { 161, "Кое от твърденията за цитирания откъс от „Крадецът на праскови“ е вярно? \r\n„Елисавета следеше редовете машинално, докато мисълта ѝ бе заета с войната. Войната бе далеч – някъде на юг и на север – ала тя се усещаше в смълчаната печал, легнала над страната, във войнишката молитва, дори в горещата, бездъхна августовска нощ. Нещо липсваше, за да бъде всичко естествено и спокойно – липсваха мъжете, младежите, липсваше самата младост. И върху фона на тия мисли тя виждаше образа на пленника, който днес беше се влачил по земята да се нахрани. Тя го чуваше да казва: „Ради бога, госпожо“, и той ѝ се струваше мъченик…“", 6, 5 },
                    { 162, "Кое от твърденията НЕ е вярно ?", 6, 5 },
                    { 163, "Кое твърдение НЕ е вярно за „До моето първо либе“?", 6, 5 },
                    { 164, "Чуждото като заплаха за националното самосъзнание на българина е представено в:", 6, 5 },
                    { 165, "В коя от посочените двойки творби природата е изобразена като враждебна на човека сила?", 6, 5 },
                    { 166, "Кой конфликт НЕ е заложен в интерпретацията на темата за вярата и надеждата в разказа „Спасова могила“?", 7, 5 },
                    { 167, "Кой от проблемите е интерпретиран и в двата посочени откъса? \r\n„„Богат е“, казва, пък го не пита \r\nколко е души изгорил живи, \r\nсироти колко той е ограбил \r\nи пред олтара бога измамил \r\nс молитви, с клетви, с думи лъжливи. \r\nИ на обществен тоя мъчител \r\nи поп, и черква с вяра слугуват…“ (Хр. Ботев, „Борба“) \r\n\r\n„– Вие мразите ония горе? – попита Дяволът и лукаво се приведе към момъка. – О, аз ще отмъстя на тия принцове и князе. Жестоко ще им отмъстя зарад братята ми, зарад моите братя, които имат лица, жълти като пясък, които стенат по-зловещо от декемврийските виелици! Виж голите им кървави меса, чуй стоновете им! Аз ще отмъстя за тях! Пусни ме!“ (Хр. Смирненски, „Приказка за стълбата“)", 7, 5 },
                    { 168, "Кой от мотивите е интерпретиран в „Две души“?", 7, 5 },
                    { 169, "Заглавието „Честен кръст“ в контекста на творбата се свързва с:", 7, 5 },
                    { 170, "Кое твърдение за думите на Лазар от „Железният светилник“ е вярно? \r\n„Не съм аз за свещеник, майко.(…) Мене друго ме тегли. Искам да направя добро на народа, големо добро и големи добрини. Да го изведа нашироко и да го науча как да живей.“", 7, 5 },
                    { 171, "Кое от твърденията за цитирания откъс от „Ноев ковчег“ („Въшкарчето“) е НЕВЯРНО? „Възнамерявах да започна бележките си с нещо голямо и красиво, достойно за двадесетия космически и ядрен век, но ето че още в самото начало ръката ми трепна и наклони перото към въшкарчето. \r\nТежко живееше въшкарчето. Живееше самотно, изритвано и гонено отвсякъде. Денем се криеше из глухите и тъмни усои на гората и само вечер се измъкваше от своето укритие. Появяваше се заедно със сивия здрач, самото то превърнато в сив здрач, сякаш не живо същество се показваше от гората, ами сив горски дух изпълзяваше от тайните ниши на неразгаданата природа. \r\nБе се родило съвсем малко, може би още недоносено в утробата на майката. По-големите от него го гонеха непрекъснато.“", 7, 5 },
                    { 172, "Кое твърдение е вярно?", 7, 5 },
                    { 173, "Кое от тълкуванията съответства на смисъла на „Потомка“?", 7, 5 },
                    { 174, "Миналото като модел за градежа на бъдещето на народа присъства в:", 7, 5 },
                    { 175, "Кои две творби утвърждават героичната смърт?", 7, 5 },
                    { 176, "Кой от мотивите е интерпретиран в „Потомка“?", 8, 5 },
                    { 177, "Кой от мотивите е интерпретиран в посочените откъси? \r\n„Да усещам своя радостта \r\nна невинното дете, което \r\nпървите снежинки от небето \r\nсбира със отворена уста.“ (А. Далчев, „Молитва“) \r\n„Във този черен като въглен град \r\nще бъде зимата навярно черна, \r\nнезнайни – ангелите и снегът. […] \r\nБял сняг ще има само във градините, \r\nкъдето са играели деца.“ (А. Далчев, „Сняг“)", 8, 5 },
                    { 178, "Заглавието „Ноев ковчег“ в контекста на творбата препраща към:", 8, 5 },
                    { 179, "Каква е ролята на епиграфа към Първа част на „Железният светилник“? \r\n„Овде дърво столовито, \r\nстоловито, грановито, \r\nгранки му са до небеси, \r\nа корени – сура земя; \r\nгранки му са мили снаи, \r\nа корени – синовите, \r\nа връшките – мили внуци!“\r\n Народна песен", 8, 5 },
                    { 180, "Каква е ролята на цитираното двустишие от „Новото гробище над Сливница“ в контекста на творбата? \r\n„Но кой ви знай, че спите в тез полета? \r\nНад ваший гроб забвеньето цъфти.“", 8, 5 },
                    { 181, "Кое от твърденията е вярно?", 8, 5 },
                    { 182, "Кое от тълкуванията съответства на смисъла на откъса от „Песента на колелетата“? \r\n„Работите му отиваха добре. Беден и прост ковач някога, сега той беше прочут майстор, при когото идеха поръчки от най-далечни краища. Работа имаше повече, отколкото му трябваше. Сали Яшар не обичаше да връща никого, пък и колкото повече работа имаше, колкото повече трябваше да бърза, толкоз по-добре работеше. Идеха му неподозирани и от него самия сили, разпалваше се, работеше със страст, с увлечение, ръката му ставаше сигурна, погледът – точен, и желязото под неговия чук добиваше неочаквано такива съвършени форми, каквито той не би могъл да направи и при най-бавната и внимателна работа. А тъкмо такава работа беше по сърце на Сали Яшар и от неговите ръце излизаха каруци, които бяха същинско чудо…“", 8, 5 },
                    { 183, "Природата като пейзаж на човешката душа присъства в:", 8, 5 },
                    { 184, "Образът на смъртта е ключов за смисловите внушения на:", 8, 5 },
                    { 185, "Кои две творби представят историята чрез образа на нейните безименни творци?", 8, 5 },
                    { 186, "Кой конфликт е заложен в интерпретацията на темата за обществото и властта в „Андрешко“?", 9, 5 },
                    { 187, "Кой от проблемите е интерпретиран и в двата посочени откъса? \r\n„Горко вам, безумни, овци заблудени, \r\nсъс гръцка отрова що сте напоени (…) \r\nТа не вашто племе срам нанася вам, \r\nо, безумни люде, а вий сте му срам!“ (Ив. Вазов, Паисий)\r\n „Вместо да бъдат първенци на народа си, те се отказваха от своето и възлюбваха чуждото, срамуваха се от своето и се гордееха с чуждото.“ (Д. Талев, Железният светилник)", 9, 5 },
                    { 188, "Кой от мотивите е интерпретиран в „Посвещение“ на Петя Дубарова?", 9, 5 },
                    { 189, "С коя от идеите се свързва заглавието „Спасова могила“ в контекста на творбата?", 9, 5 },
                    { 190, "Какъв е смисълът на началното обръщение на лирическия говорител в „История“? \r\n„Какво ще ни дадеш, историйо,/ от пожълтелите си страници?“", 9, 5 },
                    { 191, "Кое от твърденията за описанието от „Крадецът на праскови“ е НЕВЯРНО? \r\n„Към края на седмицата задуха топъл и сух вятър. Той сякаш идваше направо от пустинята, далеч от юг, носеше се ниско над земята и не водеше по небето нито едно облаче. Дълги ивици прах сочеха скритото между дърветата шосе и се разпръскваха на облаци из околността. Лазурът на небето потъмня и в сухата обилна светлина се промъкна нещо болезнено и неспокойно.“", 9, 5 },
                    { 192, "Кое от твърденията е вярно?", 9, 5 },
                    { 193, "Родното като свят на здрави морални устои е интерпретирано в:", 9, 5 },
                    { 194, "Писаната история като основен носител на паметта за славното минало присъства в:", 9, 5 },
                    { 195, "В кои две творби саможертвата се утвърждава като ценност?", 9, 5 },
                    { 196, "Кой конфликт е заложен в интерпретацията на темата за обществото и властта в „Борба“?", 10, 5 },
                    { 197, "Кой от проблемите е интерпретиран и в двата посочени откъса? \r\n„Аз не живея: аз горя. Непримирими \r\nв гърдите ми се борят две души: \r\nдушата на ангел и демон. В гърди ми\r\nте пламъци дишат и плам ме суши.“ (П. Яворов, „Две души“) \r\n„Аз съм вихър и мъгла: \r\nне зная време, нито цел \r\nв размах, пориви и стремеж.\r\n Аз съм зной и скреж.“ (П. Яворов, „Демон“)", 10, 5 },
                    { 198, "Кой от мотивите НЕ е интерпретиран в „Андрешко“ от Елин Пелин?", 10, 5 },
                    { 199, "Каква е ролята на епиграфа към одата „Паисий“ на Иван Вазов? \r\n„О, неразумни юроде! Поради что се срамиш \r\nда се наречиш Болгарин?... Или не са имали \r\nБолгаре царство и господарство? Ти, Болгарино, \r\nне прелщайся, знай свой род и язик... „Паисий (1762)", 10, 5 },
                    { 200, "Какъв е смисълът на думите на Сали Яшар от разказа „Песента на колелетата“? \r\n„Аз съм бил сляп, аз съм бил глупав! Каква чешма и какви мостове искам да правя? Себап! Има ли по-голям себап от тоя, който правя? Каруци трябва да правя аз, каруци!“", 10, 5 },
                    { 201, "Какво внушава откъсът от „Балада за Георг Хених“? \r\n„Тъжна светлина се отцеждаше по пода. Скелетът на бюфета тъмнееше в ъгъла. Формите на цигулките унило висяха по стените, ограждайки празни, крушовидни пространства, като печати на безнадеждността. Срещуположният тезгях, на който бе работил някога, проскърцваше и пропукваше, сякаш старческите му кости се чупеха. Той приклякваше все по-ниско, изравнявайки ръст с ръста на стопанина. Тъмно грееше снимката на Боженка от стената между иконите и кандилото, което никога не беше запалено, защото дядо Георги нямаше пари за олио, а баща ми бе атеист и не се сещаше да го напълни.“", 10, 5 },
                    { 202, "В коя творба любовта е извор на възхищение от любимата?", 10, 5 },
                    { 203, "Кое от твърденията е вярно?", 10, 5 },
                    { 204, "В коя творба трудът НЕ е интерпретиран като творческа дейност?", 10, 5 },
                    { 205, "В кои две творби родното се утвърждава като ценност?", 10, 5 },
                    { 208, "Коя тема е интерпретирана в откъса от „Дон Кихоте, близко е Ла Манча!“ на Дамян Дамянов? \r\n„Дон Кихоте, близко е Ла Манча! \r\nОще малко! Там сме! Още ден! \r\nНищо че ни вразумява Санчо \r\nи че Росинант е уморен! \r\nНищо че заплашват като хора \r\nмелници от вятър и стада.\r\n Нищо че от многото умора \r\nвсе ни се привижда зла беда! \r\nНищо че какви не идиоти \r\nтеб и мен наричат „идиот“!\r\n Ще ги надживеем, Дон Кихоте! \r\nАко не със друго – с цял живот! \r\nС цяла вечност, ако не със друго! \r\nС път красив, на рицарства богат! \r\nНа света, ако не съществуват „луди“, \r\nможе въобще да няма свят.“", 3, 6 },
                    { 209, "Коя тема е интерпретирана в „Пловдив“ на Димчо Дебелянов? \r\nКак бяха скръбни мойте детски дни!\r\n„О, колко много сълзи спотаени! \r\nТук първи път се моя взор стъмни \r\nи безпощадна буря сви над мене. \r\nТук първи път чух възглас: – Престани \r\nда вярваш и да дириш – забранен е \r\nна любовта плодът – и в зли страни \r\nмечтите ти навек ще бъдат пленни. \r\nИ днес аз бродя в тоя скръбен град – \r\nедничък дом на мойта скръб бездомна – \r\nаз бродя за утехата нерад – \r\nи кат загубен в пустошта огромна. \r\nИ толкоз черни мисли ми тежат, \r\nче аз не искам нищо да си спомна.“", 4, 6 },
                    { 210, "Коя тема е интерпретирана в „Добрите писма“ от Валери Петров? \r\n„Толкова радост извика \r\nписмото с добри новини! \r\nГледам клеймото на плика \r\nи пътя му смятам във дни. \r\nМисля си: значи, когато \r\nбях вчера така натъжен, \r\nлистчето, с радост богато, \r\nе вече летяло към мен. \r\nЗначи, така ни се струва \r\nпонякога черен светът. \r\nХора, недейте тъгува – \r\nдобрите писма са на път!“", 5, 6 },
                    { 211, "Коя тема е интерпретирана в „Дъждовната есенна нощ“ на Иван Пейчев? \r\n„Дъждовната есенна нощ \r\nслиза бавно по стръмния хребет \r\nи не зная, не зная защо\r\n тази нощ ми напомня за тебе. \r\nАз не зная защо съм \r\nтъй сам. \r\nАз не зная защо си \r\nприпомням за тебе, \r\nно в дъждовната \r\nесен сега \r\nти си дъжд и надежда \r\nи ромон. „", 6, 6 },
                    { 212, "Коя тема е интерпретирана в „Старица“ от Яна Кременска? \r\n„Затъкава му дъжд. Тегли нишките с помнещи пръсти. \r\nВръзва възли. Неделя е. Хвърля си сянката в мрака. \r\nМеси обреден хляб, нощвите тихо прекръства. \r\nПосле риза му шие… И излиза навън да го чака. \r\nПосле гледа към пътя и сресва посоките дълго. \r\nНе се връща стопанинът... Жъне небесната нива... \r\nСамо хлябът да стане. И после ще тръгне по мръкнало\r\n там, където е той. Да му каже: Без теб не съм жива.“", 7, 6 },
                    { 213, "Коя тема е интерпретирана в откъса от стихотворението „Размисъл“ на Владимир Башев? „Ако няма какво да дадем на света, \r\nза какво сме родени? \r\nНий не щем нито славата, ни участта \r\nна големите гении! \r\nПросто трябва \r\nда имаме нежността на оная незнайна женица, \r\nдето първа втъкала е прелестта \r\nна земята ни във шевица. \r\nПросто трябва \r\nда имаме скъпия дар,\r\n озарил оня майстор чудесен,\r\n който първи е теглил \r\nвърху явора шар \r\nи дървото е станало песен.“", 8, 6 },
                    { 214, "Коя тема е интерпретирана в откъса от стихотворението „Вечерна песен“ на Елисавета Багряна? \r\n„Изнизва се, изнизва броеницата \r\nна дните ми човешки. \r\nТъркулват се неудържими \r\nот пръстите ми отмалели \r\nзърната черно-бели. \r\nИ все едно – \r\nбили те леки или тежки, \r\nпразни или пълни, \r\nвсе едно – \r\nще ги погълне \r\nзърно подир зърно \r\nв неразгаданата си тайна \r\nвечната безкрайност...“", 9, 6 },
                    { 215, "Коя тема е интерпретирана в откъса от „Съдба“ на Елисавета Багряна? \r\n„През улиците здрачни, през къщите, стените, \r\nпрез плачещия ромон на есенния ден, \r\nпрез този град, погребан в желязо и гранити – \r\nусещам, че ме чакаш – ликуващ и смутен. \r\nУсещам твоя поглед, отправен в тъмнината, \r\nусещам ти ръцете, протегнати насън, \r\nусещам как се вслушваш за стъпките познати \r\nи как сърцето трепва при всеки шум отвън.“", 10, 6 }
                });

            migrationBuilder.InsertData(
                table: "Answers",
                columns: new[] { "Id", "Content", "IsCorrect", "QuestionId" },
                values: new object[,]
                {
                    { 49, "азиатски", true, 13 },
                    { 50, "овеличение", false, 13 },
                    { 51, "съчуствие", false, 13 },
                    { 52, "распечатка", false, 13 },
                    { 53, "Очаква се скоро да оповестят резултатите от последните изследвания на Луната.", false, 14 },
                    { 54, "Часовникарят обеща на сестра ми много бързо да поправи старинния часовник.", false, 14 },
                    { 55, "Само няколко вида безгръбначни оцеляват и при ниски минусови температури.", false, 14 },
                    { 56, "Тези два промишлени отрасла са гордост за страната и носят огромни приходи.", true, 14 },
                    { 57, "Според своя произход еко системите се делят на естествени и изкуствени.", false, 15 },
                    { 58, "В момента учим за църковно-националните борби на българите през XIX в.", false, 15 },
                    { 59, "През ваканцията заминаваме на десет дневна почивка на отдалечен остров.", false, 15 },
                    { 60, "Невинаги истината за събитията се представя обективно от историята", true, 15 },
                    { 61, "артериялен", false, 16 },
                    { 62, "немарлив", true, 16 },
                    { 63, "вишистка", false, 16 },
                    { 64, "посретствен", false, 16 },
                    { 65, "Производството на електронни игри е нараснало с 7% през последните две години.", false, 17 },
                    { 66, "Преди учениците да се качат в автобусите, им бяха дадени последни инструкций.", false, 17 },
                    { 67, "По време на финалния мач футболистите демонстрираха завидна издържливост.", false, 17 },
                    { 68, "За нуждите на експедицията бяха осигурени още два висококачествени бинокъла.", true, 17 },
                    { 69, "Старите хора разказват, че на времето в селото ни освен читалище и училище e имало и тъкачен цех.", true, 18 },
                    { 70, "Скоро очакваме доставката на новите високопроходими автомобили с дистанционно управление.", false, 18 },
                    { 71, "Новият домашен любимец на съседите ни е куче пазач, което според брат ми никак не е дружелюбно.", false, 18 },
                    { 72, "Колежът притежава модерен учебно-спортен комплекс, разположен на три етажа с 27 оборудвани зали", false, 18 },
                    { 73, "порозовяли", false, 19 },
                    { 74, "осмирителен", false, 19 },
                    { 75, "следдипломен", true, 19 },
                    { 76, "незговорчиви", false, 19 },
                    { 77, "Правилата за безопасност са задължителни за всички, които тренират в новата зала.", false, 20 },
                    { 78, "На откриването на турнира присъстваха състезатели от различни възрастови категорий.", true, 20 },
                    { 79, "Журналистът настояваше да получи отговор на въпроса, който очевидно притесни госта му.", false, 20 },
                    { 80, "Документи за участие в конкурса за директор са подали двама магистри по биология.", false, 20 },
                    { 81, "През 1935 г. във фабриката на инж. Цветан Недков е внедрен памуко-тъкачен стан", true, 21 },
                    { 82, "Планирам да започна работа като помощник-готвач още през лятната ваканция.", false, 21 },
                    { 83, "Тази година картинната галерия ще отбележи своя 25-годишен юбилей с три изложби.", false, 21 },
                    { 84, "За любителите на класическата музика концерт ще изнесе световноизвестен пианист.", false, 21 },
                    { 85, "идеален", true, 22 },
                    { 86, "еднакав", false, 22 },
                    { 87, "прелесна", false, 22 },
                    { 88, "расъдлив", false, 22 },
                    { 89, "Заради снеговалежа пътищата в западна Стара планина са затворени за автомобили.", false, 23 },
                    { 90, "При спазване на правилата за сигурност архиварят предоставя достъп до документа.", true, 23 },
                    { 91, "За изграждането на дървени зглобяеми къщи се използват само качествени материали.", false, 23 },
                    { 92, "Обсъждат се няколко финансови механизма за отпускане на заеми в публичния сектор.", false, 23 },
                    { 93, "Основна заслуга за спечеленото отличие има старши треньорът на отбора.", false, 24 },
                    { 94, "Под прозореца в хола поставихме тъмносин диван и дизайнерска маса.", false, 24 },
                    { 95, "Напоследък се отчита значителен ръст на заплахите в киберпространството.", false, 24 },
                    { 96, "Преди две седмици 80 годишният творец даде интервю по телевизията.", true, 24 },
                    { 97, "азиятец", false, 25 },
                    { 98, "уповестявам", false, 25 },
                    { 99, "злонамеренност", false, 25 },
                    { 100, "подложка", true, 25 },
                    { 101, "Ще започна работа в Българската академия на науките.", false, 26 },
                    { 102, "Професията на пожарникара крие твърде много рискове.", true, 26 },
                    { 103, "Лошо е да бъдеш тесногръд, когато работиш с хора.", false, 26 },
                    { 104, "За свободната позиция кандидатстваха трима бакалаври.", false, 26 },
                    { 105, "В седем дневен срок трябва да бъде внесен за разглеждане нов проект.", false, 27 },
                    { 106, "Трябва да науча репликите си на изуст, преди да отида на репетиция днес.", false, 27 },
                    { 107, "Майка ми е почитателка на старите филми, черно белите са ѝ любими.", false, 27 },
                    { 108, "Тя взе своето съдбоносно решение, не мислейки за последствията от него.", true, 27 },
                    { 125, "След премиерата актрисата благодари на своите почитатели.", true, 32 },
                    { 126, "Във фестивала участваха десет танцови състави от цялата страна.", false, 32 },
                    { 127, "Пълният текст на доклада ще публикуваме скоро на нашия сайт.", false, 32 },
                    { 128, "Спектакълът зарадва ценителите на балетното и оперно изкуство.", false, 32 },
                    { 129, "Лекторът обясни някои разлики между фолклорната и авторската приказка.", false, 33 },
                    { 130, "Туристите се настаниха в апартамент, чийто прозорци гледаха към площада.", true, 33 },
                    { 131, "Управителят на Българската народна банка благодари за получената награда.", false, 33 },
                    { 132, "Господин Иванов, радваме се, че лично сте подкрепили нашата инициатива.", false, 33 },
                    { 133, "Опитваме се да откриеме повече информация за предстоящото събитие.", false, 34 },
                    { 134, "В галерията е открита изложба на двама утвърдени френски художника.", false, 34 },
                    { 135, "Отговора на загадката успяха да намерят само наблюдателните ученици.", true, 34 },
                    { 136, "Изобилието от подправки е характерно за индийската и корейска кухня.", false, 34 },
                    { 137, "Кресненското и Искърското дефилета са сред любимите места на фотографите.", true, 35 },
                    { 138, "По време на екскурзията групата посети редица исторически и културни обекти.", false, 35 },
                    { 139, "Всеки от нас се нуждае от някого, който да го познава добре и да го подкрепя.", false, 35 },
                    { 140, "Стремейки се да бъде забелязан, стажантът показа голямо старание в работата си.", false, 35 },
                    { 141, "Тази вечер талантливата пианистка ще изнесе първия си самостоятелен концерт.", false, 36 },
                    { 142, "В пет жилищни райони се проведе акция за почистване на парковите площи.", true, 36 },
                    { 143, "Във вторник ще бъде обявен победителят в конкурса за превод на поезия.", false, 36 },
                    { 144, "Първото място в състезанието си поделиха пловдивските и бургаските ученици.", false, 36 },
                    { 145, "А", true, 37 },
                    { 146, "Б", false, 37 },
                    { 147, "В", false, 37 },
                    { 148, "Г", false, 37 },
                    { 149, "Няколкото бели лебеди, плуващи в езерото, привличаха погледите на минувачите.", true, 38 },
                    { 150, "Хотелът разполага с десет единични стаи за гости и с четири големи апартамента.", false, 38 },
                    { 151, "Новия разказ на писателя можете да прочетете в мартенския брой на списанието.", false, 38 },
                    { 152, "Осигурени са средства за финансова подкрепа на малките и средните предприятия.", false, 38 },
                    { 153, "През Възраждането светската и духовната власт търпят дълбоки промени.", true, 39 },
                    { 154, "Отборът по математика за пореден път заслужено завоюваха златни медали.", false, 39 },
                    { 155, "Бяха се преместили наскоро и все още не познаваха никой в новия квартал.", false, 39 },
                    { 156, "Господин Иванов, разбрах, че Вие сам сте решил да се откажете от проекта.", false, 39 },
                    { 157, "А", true, 40 },
                    { 158, "Б", false, 40 },
                    { 159, "В", false, 40 },
                    { 160, "Г", false, 40 },
                    { 161, "Спортът и подходящата диета помага за поддържане на добра физическа форма.", false, 41 },
                    { 162, "Готови сме да обсъждаме проблема и да набележиме мерки за неговото решаване.", false, 41 },
                    { 163, "Официалните гости дадоха обширно интервю по Българската национална телевизия.", true, 41 },
                    { 164, "Господин Иванов, разбрах, че вчера сте взел решение да участвате в нашия нов проект.", false, 41 },
                    { 165, "Трябва да имаме речева стратегия, когато започваме да говориме.", false, 42 },
                    { 166, "Най-посещаван на празници е манастира, разположен над града.", false, 42 },
                    { 167, "Конкуренцията между българския и полския отбор е голяма.", true, 42 },
                    { 168, "Явиха се само двама кандидата за предложената позиция.", false, 42 },
                    { 169, "Новият и старият директор отправиха емоционални послания към служителите.", false, 43 },
                    { 170, "Следващите пет заглавия са на филми, чийто касов успех едва ли някога ще бъде надминат.", false, 43 },
                    { 171, "От самото си създаване нашият екип работи с Държавна агенция за закрила на детето.", true, 43 },
                    { 172, "Уважаеми господин Петров, съжалявам, че толкова дълго сте чакали решението на комисията.", false, 43 },
                    { 173, "Българските лекоатлети добавиха още два медала към колекцията си от отличия.", false, 44 },
                    { 174, "Един от предложените критерии за оценяване се оказа неприложим в практиката.", false, 44 },
                    { 175, "За треньор на отбора избраха брат ми – най-добрият волейболист в областта.", true, 44 },
                    { 176, "В електронния портал могат да се проверяват здравните и пенсионните осигуровки.", false, 44 },
                    { 177, "А", true, 45 },
                    { 178, "Б", false, 45 },
                    { 179, "В", false, 45 },
                    { 180, "Г", false, 45 },
                    { 181, "Младият цигулар стана най-награждаваният български музикант.", true, 46 },
                    { 182, "За най-добро представяне са отличени българските и чешки участници.", false, 46 },
                    { 183, "Вчера младата лекоатлетка спечели нейния първи златен медал.", false, 46 },
                    { 184, "Фирмата ще закупи още петдесет нови електрически автомобили.", false, 46 },
                    { 185, "Плуването влияе благоприятно върху двигателната, дихателната и нервната система.", false, 47 },
                    { 186, "Запознах се с писателя, чийто романи са преведени на почти всички европейски езици.", true, 47 },
                    { 187, "Много доброволци се включиха в новата инициатива на Министерството на културата.", false, 47 },
                    { 188, "Господин Иванов, Вие лично сте поканен да присъствате на откриването на новата зала", false, 47 },
                    { 205, "Цветовата гама от жълти, сини и зелени тонове, се допълва с бяло и виолетово.", true, 52 },
                    { 206, "Януарският сняг направи непроходим единствения път, водещ към малкото село.", false, 52 },
                    { 207, "Уважаеми господин Пантелеев, най-сърдечно Ви поздравяваме с Вашия юбилей!", false, 52 },
                    { 208, "Необходимо е декларацията да се подпише или от бащата, или от майката на ученика.", false, 52 },
                    { 209, "Гората, през която вървяха, беше гъста и слънчевите лъчи ту се промъкваха между клоните на дърветата, ту се губеха.", true, 53 },
                    { 210, "Въпреки, че беше късно, двамата продължиха разговора, припомняйки си весели моменти от ученическите години.", false, 53 },
                    { 211, "Истинският приятел знае как да те успокои, когато си притеснен и винаги намира начин да те накара да се усмихнеш.", false, 53 },
                    { 212, "Младият мъж е работил, като журналист и филмов критик, преди да стане известен с научнофантастичните си романи.", false, 53 },
                    { 213, "От този магазин ще можете да си купите качествени вълнени, котленски килими.", true, 54 },
                    { 214, "Сред фигурите, развиващи въображението от най-ранна възраст, са триъгълниците.", false, 54 },
                    { 215, "Сполучливо вписан в модерното градско пространство, дворецът е радост за окото.", false, 54 },
                    { 216, "Господин Петров, как ще стимулирате участието на гражданите в управлението?", false, 54 },
                    { 217, "Широкото шосе, което излизаше от града и прекосяваше полето, беше пусто и неосветено.", false, 55 },
                    { 218, "Въпреки че беше май и слънцето грееше, най-високите върхове на планината бяха покрити със сняг.", false, 55 },
                    { 219, "Когато се събудих, видях, че небето е покрито с тъмни облаци и реших да не излизам навън.", true, 55 },
                    { 220, "Между двата града имаше стар път, който почти не се използваше, тъй като беше тесен и стръмен.", false, 55 },
                    { 221, "В Прага можете да видите, както много улични музиканти и артисти, така и тълпи от туристи.", true, 56 },
                    { 222, "Проучването, проведено от екипа ни, изследва ползите от редовната физическа активност.", false, 56 },
                    { 223, "Уважаеми госпожи и господа, давам думата на Иван Стоянов, новия изпълнителен директор.", false, 56 },
                    { 224, "Разположен на брега на морето, новопостроеният хотел предлага великолепна гледка към залива.", false, 56 },
                    { 225, "А", false, 57 },
                    { 226, "Б", false, 57 },
                    { 227, "В", true, 57 },
                    { 228, "Г", false, 57 },
                    { 229, "Броят на клиентите, търсещи дигитални услуги и системи за сигурност, постоянно расте.", false, 58 },
                    { 230, "Всички собственици на земеделски имоти, трябва да спазват посочените нормативни изисквания.", true, 58 },
                    { 231, "Седнал на брега, той гледаше ту лодките в морето, ту летящите в небето чайки.", false, 58 },
                    { 232, "В центъра на светилището се намира голяма гранитна плоча с издълбани в нея надписи.", false, 58 },
                    { 233, "Комисията ще разгледа офертите на фирмите, подали документи за участие в конкурса, и ще вземе решение.", false, 59 },
                    { 234, "Азбучна истина е, че можем да постигнем целта си с добре обмислен план като го следваме неотклонно.", true, 59 },
                    { 235, "След като обсъдихме въпроса, се оказа, че може да се включим и ние в проекта, който стартира след месец.", false, 59 },
                    { 236, "Потребителите ще имат възможност да ползват голямо намаление, при условие че закупят абонамент за 2 години.", false, 59 },
                    { 237, "Предложеният от нашия водач маршрут е труден, но предпочитан от планинарите.", false, 60 },
                    { 238, "В града има интересни обекти, представени по интригуващ начин в пътеводителя.", false, 60 },
                    { 239, "Създаден по действителен случай, документалният филм предизвиква интерес.", false, 60 },
                    { 240, "Вие, уважаеми зрители най-добре можете да оцените достойнствата на пиесата.", true, 60 },
                    { 241, "На камбанарията не се виждаше никой, а тежките камбани се люлееха свободно и леко, и биеха самички.", false, 61 },
                    { 242, "Вярваме убедено, че, ако положим достатъчно усилия и покажем воля, ще постигнем така желаната победа.", false, 61 },
                    { 243, "Да пътуваш в група, е възможност лесно да се сближиш с нови хора, защото имаш с тях общи преживявания и емоции.", true, 61 },
                    { 244, "Изплаших се, не когато видях, че съм останал сам във вътрешната галерия, а когато всички светлини угаснаха.", false, 61 },
                    { 245, "Подходящ за всеки сезон, този нов парфюм съчетава аромати на лайм, портокал и жасмин.", false, 62 },
                    { 246, "Нощното августовско небе, обсипано с безброй звезди, се разстилаше пред погледа му.", false, 62 },
                    { 247, "Филмът на младия български режисьор ми хареса и като концепция, и като реализация.", false, 62 },
                    { 248, "В днешното предаване скъпи слушатели, ще разговаряме за опазването на тревните площи.", true, 62 },
                    { 249, "Това е човекът, на когото мога да доверя всичките си тайни и който винаги ми е помагал в живота.", false, 63 },
                    { 250, "Учените все още не знаят със сигурност защо хората сънуват и дали сънищата имат връзка с преживяното.", false, 63 },
                    { 251, "Странно е поведението на онези, които, за да бъдат харесвани от всички са безкритични.", true, 63 },
                    { 252, "Едва ли има родител, който да не иска да зарадва детето си, като му отделя повече време.", false, 63 },
                    { 253, "В старинния храм няма дори прозорци, а само малки отвори, приличащи на очи.", false, 64 },
                    { 254, "Предпочитам да се разхождам по крайбрежната алея, а не по пясъчната ивица.", false, 64 },
                    { 255, "Туристите се любуваха на Троянската планина преминавайки през Беклемето.", true, 64 },
                    { 256, "Нека насочим вниманието си, уважаеми посетители, към последната зала на музея.", false, 64 },
                    { 257, "Никой в градчето обаче не знаеше нито откъде беше дошъл чужденецът, нито какво е истинското му име.", true, 65 },
                    { 258, "Въпреки, че мъглата ставаше все по-гъста, туристът реши да не спира, а да продължи да се изкачва към върха.", false, 65 },
                    { 259, "Харесва ми да пътувам не само, защото виждам нови места, но и защото така опознавам различни култури.", false, 65 },
                    { 260, "Наблюдавайки хората около себе си, той се убеди напълно, че, за да успее в живота, трябва да продължи да учи.", false, 65 },
                    { 261, "Голямата розова къща на хълма привличаше погледите на всички.", false, 66 },
                    { 262, "Науката, изучаваща значението на знаците, се нарича семиотика.", false, 66 },
                    { 263, "Пожелавам Ви уважаеми колеги, успешна и спокойна седмица.", true, 66 },
                    { 264, "На срещата бяха поканени както децата, така и техните родители.", false, 66 },
                    { 265, "А", false, 67 },
                    { 266, "Б", true, 67 },
                    { 267, "В", false, 67 },
                    { 268, "Г", false, 67 },
                    { 301, "Ако хората спортуват поне по 150 минути седмично, ще живеят по-дълго.", true, 76 },
                    { 302, "За да се излекуват от хронични заболявания, хората трябва да спортуват.", false, 76 },
                    { 303, "Редовно спортуващите е изключено да получат травми, докато тренират.", false, 76 },
                    { 304, "Спортът оказва благотворно влияние единствено върху физическото здраве.", false, 76 },
                    { 305, "пренебрегването на възстановяването след тренировка", false, 77 },
                    { 306, "погрешната техника на изпълнение на упражненията", false, 77 },
                    { 307, "изминаването на отсечки от по един километър пеша", true, 77 },
                    { 308, "подценяването на загряването преди тренировка", false, 77 },
                    { 309, "Основна причина хората между 16 и 30 г. да не спортуват, е недостигът на финансови средства.", false, 78 },
                    { 310, "Недостигът на финансови средства е най-често посочван като причина да не спортуват, от хората над 50 г.", true, 78 },
                    { 311, "Хората между 31 и 50 г. посочват най-рядко като причина да не спортуват, липсата на свободно време.", false, 78 },
                    { 312, "Хората на възраст между 16 и 30 г. посочват най-често, че няма къде да упражняват спортни дейности.", false, 78 },
                    { 313, "Анкетираните над 50 години, които посочват, че няма къде да спортуват, са по-голям дял от тези между 16 и 30 години.", true, 79 },
                    { 314, "Анкетираните между 31 и 50 години, които не обичат да спортуват, са по-малък процент от тези над 50 години.", false, 79 },
                    { 315, "Анкетираните между 16 и 30 години най-много от трите възрастови групи се страхуват, че ще се наранят при спорт.", false, 79 },
                    { 316, "Анкетираните между 31 и 50 години, които не са мотивирани от някого да спортуват, са 40%.", false, 79 },
                    { 317, "Необходими са нови капиталовложения.", false, 80 },
                    { 318, "Нужен е склад за съхранение на стоката.", false, 80 },
                    { 319, "Има ограничения във времето за поръчки.", true, 80 },
                    { 320, "Предлагат се промоционални оферти.", false, 80 },
                    { 321, "Пазаруването по интернет е изгодно и за търговците, и за клиентите.", true, 81 },
                    { 322, "Онлайн пазаруването е по-екологично от традиционната търговия.", false, 81 },
                    { 323, "Традиционното пазаруване е по-сигурно от пазаруването по интернет.", false, 81 },
                    { 324, "Онлайн пазаруването изисква повече разходи от страна на търговците.", false, 81 },
                    { 325, "Стоките се поставят в допълнителни опаковки.", false, 82 },
                    { 326, "Има разминавания между поръчка и доставка.", false, 82 },
                    { 327, "Има допълнителни разходи за доставка.", false, 82 },
                    { 328, "Обичайно се поръчват много стоки наведнъж.", true, 82 },
                    { 329, "Увеличават се трудностите при откриването на информация за гаранционния срок на покупката.", false, 83 },
                    { 330, "Нараства делът на доставка на повредени или различни от поръчаните по интернет стоки.", false, 83 },
                    { 331, "Отказът от страна на чуждестранни търговци да правят доставки онлайн до България, бележи ръст.", false, 83 },
                    { 332, "Намаляват проблемите с нелоялни търговци при пазаруването по интернет у нас.", true, 83 },
                    { 333, "В Древния Рим рекламата е поставена на научни основи.", false, 84 },
                    { 334, "Провокира критично отношение към рекламирания продукт.", false, 84 },
                    { 335, "Рекламата насърчава асоциативното мислене у зрителите.", true, 84 },
                    { 336, "Прави съпреживяването на гледаните предавания по-силно.", false, 84 },
                    { 337, "Рекламата е едновременно и създадена от човека реалност, но и създаваща нова реалност.", true, 85 },
                    { 338, "Съвременният човек търси рекламата, за да се ориентира в многообразието от продукти.", false, 85 },
                    { 339, "В сложния съвременен свят рекламата направлява дискретно търсенията на потребителя.", false, 85 },
                    { 340, "Рекламата е не само рожба на масовото производство, но и формира естетическия вкус", false, 85 },
                    { 341, "И четирите телевизии излъчват рекламни блокове в рамките на цялото денонощие.", true, 86 },
                    { 342, "Рекламни блокове се излъчват единствено в праймтайма и на четирите телевизии.", false, 86 },
                    { 343, "Най-дългите рекламни блокове се излъчват от всички телевизии в най-гледаното време.", false, 86 },
                    { 344, "По всички телевизии рекламите през денонощието имат една и съща продължителност.", false, 86 },
                    { 345, "Спрямо останалите часови диапазони най-кратките рекламни блокове по Телевизия 2 са във времето от 9:00 ч. до 17:00 ч.", false, 87 },
                    { 346, "Всички рекламни блокове на Телевизия 2 са с еднаква продължителност във всички часови диапазони.", false, 87 },
                    { 347, "В сравнение с другите телевизии рекламните блокове на Телевизия 3 са най-кратки във времето от 9:00 ч. до 17:00 ч.", false, 87 },
                    { 348, "Рекламните блокове на Телевизия 3 са най-продължителни в часовия диапазон от 17:00 ч. до 19:00 ч.", true, 87 },
                    { 349, "в Швейцария", false, 88 },
                    { 350, "в Тибет", false, 88 },
                    { 351, "в Аляска", true, 88 },
                    { 352, "в Африка", false, 88 },
                    { 353, "се вълнуват от промените на температурата в световен план", false, 89 },
                    { 354, "продължават да подценява промените в климата на Земята", true, 89 },
                    { 355, "се тревожат, че климатичните промени ще доведат до потъването на цели държави", false, 89 },
                    { 356, "се успокояват, че климатичните промени засега не са обхванали равномерно Земята", false, 89 },
                    { 357, "Съществуват решения за намаляване на въздействието на човека върху климата.", true, 90 },
                    { 358, "Всички хора са готови да променят собствения си разточителен начин на живот.", false, 90 },
                    { 359, "Единствено учените могат да решат сериозните проблеми с глобалното затопляне.", false, 90 },
                    { 360, "Хората осъзнават своята безпомощност да се справят с изменението на климата.", false, 90 },
                    { 361, "Еднакъв е делът на хората, склонни да намалят пътуванията със самолет и пътуванията с автомобил.", false, 91 },
                    { 362, "Еднакъв е делът на хората, склонни да ограничат използването на вода и купуването на стоки в пластмасови опаковки.", true, 91 },
                    { 363, "Еднакъв е делът на хората, склонни да купуват енергоефективни уреди и да консумират повече местни и сезонни продукти.", false, 91 },
                    { 364, "Еднакъв е делът на хората, склонни да изхвърлят отпадъците си разделно и да пътуват по-малко със самолет и автомобил.", false, 91 },
                    { 365, "Мърквичка създава всички живописни жанрове, сред които са натюрмортът и пейзажът.", false, 92 },
                    { 366, "В работата си художникът отрича практикуваното тогава в България рисуване по натура.", false, 92 },
                    { 367, "За картината „Ръченица“ Ян Мърквичка кани ирландец, който е с български произход.", false, 92 },
                    { 368, "Чешкият художник допринася за утвърждаването на професията на художника у нас.", true, 92 },
                    { 369, "Използва германския опит, когато обучава момичета в тънкостите на рисувателни техники.", true, 93 },
                    { 370, "Спомага новосъздаденото Държавно рисувално училище да си спечели име извън България.", false, 93 },
                    { 371, "Въпреки суеверието на българите намира начин да рисува сюжети по натура.", false, 93 },
                    { 372, "Оглавява създаденото в София през 1896 г. Държавно рисувателно училище.", false, 93 },
                    { 373, "Малко са хората, чиито лица са подходящи за картините на художника.", false, 94 },
                    { 374, "Българите не вярват, че носиите им ще бъдат пресъздадени реалистично.", false, 94 },
                    { 375, "Хората не се съгласяват да позират на художника, защото не е българин.", false, 94 },
                    { 376, "Заради суеверие хората се страхуват от смърт, ако бъдат нарисувани.", true, 94 },
                    { 377, "Повечето анкетирани смятат, че художественото образование е сериозен приоритет в сравнение с други предмети.", true, 95 },
                    { 378, "Повечето анкетирани поддържат мнението, че учениците имат достатъчен досег до изкуство през учебните програми.", false, 95 },
                    { 379, "Повечето анкетирани са съгласни, че училището предоставя допълнителни възможности за занимания с изкуство.", false, 95 },
                    { 380, "Повечето анкетирани смятат, че училището не си сътрудничи често с гостуващи художници.", false, 95 },
                    { 381, "В операта отсъства „нормалната“ човешка реч и се набляга единствено на пеенето.", false, 96 },
                    { 382, "В операта на преден план се извежда самият сюжет, изпълнен с остри конфликти.", false, 96 },
                    { 383, "Операта се въздържа от подражанието на действителността и от дребнотемието.", true, 96 },
                    { 384, "На операта отдавна не може да се гледа като на някакво културно удоволствие.", false, 96 },
                    { 385, "Операта си остава непреходно изкуство.", true, 97 },
                    { 386, "Цените на билетите за опера са прекалено скъпи.", false, 97 },
                    { 387, "Оперното изкуство вече е отживелица.", false, 97 },
                    { 388, "Операта трябва да се отрече като „буржоазно изкуство“.", false, 97 },
                    { 389, "Защото певицата е наясно, че това рано или късно все ще се случи.", false, 98 },
                    { 390, "Защото певицата не иска да изрече на глас, че операта може да загине.", true, 98 },
                    { 391, "Защото певицата си дава сметка, че операта никога няма да загине.", false, 98 },
                    { 392, "Защото певицата е убедена, че съвременната музика ще измести операта.", false, 98 },
                    { 393, "свят на технологиите – свят на изкуството", false, 99 },
                    { 394, "комерсиалност в изкуството – безкомпромисност в изкуството", false, 99 },
                    { 395, "почитатели на поп музиката – почитатели на оперното изкуство", false, 99 },
                    { 396, "фолклорна музика – класическа музика", true, 99 },
                    { 397, "Така успешно се подпомага по-бързото развитие на детето.", false, 100 },
                    { 398, "Така детето започва да усвоява знания от най-ранна възраст.", false, 100 },
                    { 399, "Защото четенето на глас развива артистичността на детето.", false, 100 },
                    { 400, "Защото четенето влияе позитивно на връзката родител – дете.", true, 100 },
                    { 401, "Личният пример на родителите като читатели е много важен за децата.", false, 101 },
                    { 402, "Всеки в ролята на читател неусетно става и съавтор на прочетеното.", false, 101 },
                    { 403, "Четенето и гледането на филми еднакво развиват въображението ни.", true, 101 },
                    { 404, "Компютърните игри и филмите могат да влияят негативно върху сетивата ни.", false, 101 },
                    { 405, "Четенето ни кара да се превъплъщаваме в любими герои от книгите.", false, 102 },
                    { 406, "Четенето е в основата на стремежа да променяме света към по-добро.", false, 102 },
                    { 407, "Четенето е ценно най-вече с това, че дава простор на въображението ни.", true, 102 },
                    { 408, "Читателят за разлика от зрителя е пасивен получател на информация.", false, 102 },
                    { 409, "Четенето на различни текстове не се отразява на резултатите по четивна грамотност.", false, 103 },
                    { 410, "Четенето на текстове от художествената литература повишава резултатите по четивна грамотност.", true, 103 },
                    { 411, "Четенето на текстове от документалната литература повишава в най-голяма степен четивната грамотност.", false, 103 },
                    { 412, "Тези, които не четат вестници и комикси, имат по-ниски резултати по четивна грамотност.", false, 103 },
                    { 413, "Защото с прилагането им на практика неизбежно се стига до диктатура.", false, 104 },
                    { 414, "Защото спазването на един от принципите води до нарушаването на друг.", true, 104 },
                    { 415, "Защото са издигнати с цел революцията да събере повече поддръжници.", false, 104 },
                    { 416, "Защото бащите на революцията ги провъзгласяват, за да станат известни.", false, 104 },
                    { 417, "Революциите изискват да се заеме неутрална позиция спрямо тях.", false, 105 },
                    { 418, "Революциите винаги обещават неща, които не могат да изпълнят.", true, 105 },
                    { 419, "Хората по света са различни, но революцията винаги е една и съща.", false, 105 },
                    { 420, "Свободата може да се постигне единствено по пътя на революцията.", false, 105 },
                    { 421, "Революциите са пречка за общественото развитие.", false, 106 },
                    { 422, "С революциите се постига консенсус в обществото.", false, 106 },
                    { 423, "Основна цел на революциите е налагането на диктатура.", false, 106 },
                    { 424, "Революциите неизбежно водят до обществени промени.", true, 106 },
                    { 425, "равноправие – неравенство", false, 107 },
                    { 426, "надежда – разочарование", true, 107 },
                    { 427, "обновление – застой", false, 107 },
                    { 428, "прогрес – регрес\r\n******", false, 107 },
                    { 501, "приятелство – предателство", false, 126 },
                    { 502, "живот – смърт", false, 126 },
                    { 503, "замисъл – реализация", false, 126 },
                    { 504, "състрадание – безразличие", true, 126 },
                    { 505, "за героичната саможертва в името на родината", true, 127 },
                    { 506, "за забравата на героите на българската свобода", false, 127 },
                    { 507, "за безсмислието на смъртта в жестоката война", false, 127 },
                    { 508, "за страданието на майките за достойните синове", false, 127 },
                    { 509, "за словесната агресия в печата", false, 128 },
                    { 510, "за политическото нагаждачество", false, 128 },
                    { 511, "за превратностите на съдбата", true, 128 },
                    { 512, "за грубия материализъм в живота", false, 128 },
                    { 513, "споделените чувства на двама влюбени", false, 129 },
                    { 514, "хармонията в живота на лирическия говорител", false, 129 },
                    { 515, "сблъсъка между земния и небесния свят", false, 129 },
                    { 516, "вътрешния конфликт на лирическия говорител", true, 129 },
                    { 517, "„Град! – парчета – / яйце и орех… Спри… Недей… / Труд кървав, Боже, пожалей!“", false, 130 },
                    { 518, "„Да бъде тъй неделя още, / неделя пек и мирно време, / олекна ще и тежко бреме, / на мъките ни края до ще.“", false, 130 },
                    { 519, "„И всички емнали се боси, / с лица мъртвешки посивели, / отиват: вечно зло ги носи / към ниви глухо опустели.“", true, 130 },
                    { 520, "„Милост няма! / И дебне пак беда голяма. / На завет всичко се прибира, / сърцето тръпне, в страх примира, / че горе – дим и адски тътен.“", false, 130 },
                    { 521, "Образите на липата и на колибата са контрастни.", false, 131 },
                    { 522, "Огледалото буди трепетни вълнения у Елисавета.", false, 131 },
                    { 523, "Колибата е приютяващият дом за Елисавета.", true, 131 },
                    { 524, "Липата се превръща в довереница на героинята.", false, 131 },
                    { 525, "Както в „При Рилския манастир“, така и в „Спи езерото“ природата носи хармония и душевен мир.", true, 132 },
                    { 526, "За разлика от „Спи езерото“ в „При Рилския манастир“ природата носи усещане за тъга и меланхолия.", false, 132 },
                    { 527, "Както в „При Рилския манастир“, така и в „Спи езерото“ се описва величествената красота на родното.", false, 132 },
                    { 528, "За разлика от „При Рилския манастир“ в „Спи езерото“ природата се асоциира с чуждото и далечното.", false, 132 },
                    { 529, "Стихотворението разкрива конфликта между човека и обществото.", false, 133 },
                    { 530, "Творбата утвърждава вярата като условие за съществуването на човека.", true, 133 },
                    { 531, "Произведението внушава разочарованието от излъганите надежди.", false, 133 },
                    { 532, "Текстът представя героичната саможертва на човека в името на родината.", false, 133 },
                    { 533, "„Андрешко“", false, 134 },
                    { 534, "„Потомка“", false, 134 },
                    { 535, "„Борба“", true, 134 },
                    { 536, "„История“", false, 134 },
                    { 537, "„Вяра“ и „Аз искам да те помня все така“", false, 135 },
                    { 538, "„Колко си хубава!“ и „Честен кръст“", false, 135 },
                    { 539, "„Посвещение“ и „Крадецът на праскови“", true, 135 },
                    { 540, "„Две души“ и „До моето първо либе“", false, 135 },
                    { 541, "вяра – неверие", false, 136 },
                    { 542, "богатство – бедност", false, 136 },
                    { 543, "отмъщение – прошка", false, 136 },
                    { 544, "надежда – отчаяние", true, 136 },
                    { 545, "за ненавистта на богатия към истинския патриот", false, 137 },
                    { 546, "за безкритичното следване на обществени заблуди", true, 137 },
                    { 547, "за истинския родолюбив героизъм", false, 137 },
                    { 548, "за състраданието на богатия към онеправданите", false, 137 },
                    { 549, "решението на Андрешко да помогне на Станоя", false, 138 },
                    { 550, "разкриването на целта на пътуването на съдията", false, 138 },
                    { 551, "отношението на съдията към селяните", false, 138 },
                    { 552, "изоставянето на съдията в блатото", true, 138 },
                    { 553, "Текстът разкрива конфликта между смиреното търпение и социалния бунт.", false, 139 },
                    { 554, "Смъртта на Монката е представена като изцеление и спасение от земните страдания.", true, 139 },
                    { 555, "Творбата изгражда представата за свят, в който болестите са наказанието за бедните.", false, 139 },
                    { 556, "Съдбата на малкото момче е надмогване на болката и примирение със злото.", false, 139 },
                    { 557, "Мнителността на Сали Яшар, провокирана от недоверието му към хората.", false, 140 },
                    { 558, "Проницателността му, проявена в способността да усети болката на другия.", true, 140 },
                    { 559, "Отегчението на Сали Яшар, породено от честите и еднообразни срещи с пазача.", false, 140 },
                    { 560, "Равнодушието му към Джапар, появило се поради отхвърленото предложение за брак.", false, 140 },
                    { 561, "Природата е изобразена като безжизнена и пуста.", false, 141 },
                    { 562, "Природата пробужда творческите сетива на поета.", true, 141 },
                    { 563, "Разкрита е отдалечеността на човека от природата.", false, 141 },
                    { 564, "Сред природата лирическият аз за пръв път става творец.", false, 141 },
                    { 565, "И в „Аз искам да те помня все така“, и в „Колко си хубава!“ щастието в любовта е невъзможно.", false, 142 },
                    { 566, "За разлика от „Аз искам да те помня все така“ в „Колко си хубава!“ раздялата е кулминационно преживяване.", false, 142 },
                    { 567, "За разлика от „Колко си хубава!“ в „Аз искам да те помня все така“ чрез раздялата се придава святост на любовта.", true, 142 },
                    { 568, "И в „Аз искам да те помня все така“, и в „Колко си хубава!“ любовта е обвързана с физическата красота.", false, 142 },
                    { 569, "Раздиран от вътрешни противоречия, човекът изпитва разрушително страдание.", true, 143 },
                    { 570, "Раздвоението на човека е породено от лутанията му между миналото и бъдещето.", false, 143 },
                    { 571, "Човекът преживява дълбоко страдание, но то е само временно и е преодолимо.", false, 143 },
                    { 572, "Въпреки преживяваното страдание човекът има утеха, че оставя следа след себе си.", false, 143 },
                    { 573, "„Балкански синдром“", false, 144 },
                    { 574, "„Крадецът на праскови“", false, 144 },
                    { 575, "„Ветрената мелница“", true, 144 },
                    { 576, "„Потомка“", false, 144 },
                    { 577, "„Вяра“ и „При Рилския манастир“", false, 145 },
                    { 578, "„Паисий“ и „Железният светилник“", true, 145 },
                    { 579, "„Потомка“ и „Балкански синдром“", false, 145 },
                    { 580, "„История“ и „Приказка за стълбата“", false, 145 },
                    { 581, "за спасението на страдащите", true, 146 },
                    { 582, "за опрощението на разкаялите се", false, 146 },
                    { 583, "за наказанието на грешниците", false, 146 },
                    { 584, "за озлоблението на бедните", false, 146 },
                    { 585, "за достигналото своя предел човешко страдание", true, 147 },
                    { 586, "за покварената и деспотична власт", false, 147 },
                    { 587, "за невъзможния избор в света на неправдата", false, 147 },
                    { 588, "за безсилието на човека, обречен на страдание", false, 147 },
                    { 589, "за революцията като нравствен съд", false, 148 },
                    { 590, "за възможното щастливо бъдеще", true, 148 },
                    { 591, "за краха на мечтите и надеждите", false, 148 },
                    { 592, "за вечното раздвоение на човека", false, 148 },
                    { 593, "уважението на героя към журналистическа професия", false, 149 },
                    { 594, "колебанията на героя относно журналистическите му умения", false, 149 },
                    { 595, "пренебрежението на героя към мисията на журналистиката", true, 149 },
                    { 596, "несигурността на героя, породена от сложността на начинанието", false, 149 },
                    { 597, "„И може би рядко някой ще го каже, но в душата на всекиго е благодарност към бога и хвала към онзи, който беше направил тая чешма…“", false, 150 },
                    { 598, "„Аз съм бил сляп, аз съм бил глупав! Каква чешма и какви мостове искам да правя? Себап! Има ли по-голям себап от тоя, който правя? Каруци трябва да правя аз, каруци!“", true, 150 },
                    { 599, "„Каруците пееха по пътищата и сякаш разказваха как един човек може да бъде много богат, но и много злочест. Защото за какво му беше това богатство на Сали Яшар?“", false, 150 },
                    { 600, "„...болестта на Сали Яшар се влоши, калфите не можеха да работят вече сами и чуковете изведнъж замлъкнаха. Това мълчание уплаши Сали Яшар и едвам сега той разбра, че е болен тежко и че може да умре.“", false, 150 },
                    { 601, "Насочва към самотността и тайнствеността на монаха.", true, 151 },
                    { 602, "Представя критиката на Паисий срещу родоотстъпниците.", false, 151 },
                    { 603, "Внушава разочарование от забравата на Паисиевото дело.", false, 151 },
                    { 604, "Загатва скромното значение на Паисиевата история.", false, 151 },
                    { 605, "Както в „Молитва“, така и във „Вяра“ надеждата за пълноценен живот се свързва с детската невинност.", false, 152 },
                    { 606, "За разлика от „Молитва“ във „Вяра“ героят е готов да рискува всичко в името на утрешния по-добър свят.", true, 152 },
                    { 607, "Както в „Молитва“, така и във „Вяра“ човекът се уповава на вярата, изразяваща се в духовната връзка с Бога.", false, 152 },
                    { 608, "За разлика от „Молитва“ във „Вяра“ искрената вяра дарява човека с утеха и духовно просветление.", false, 152 },
                    { 609, "Пред интимната любов всичко друго в живота губи значението си.", false, 153 },
                    { 610, "Любовната песен е единствената утеха за страдащото сърце на героя.", false, 153 },
                    { 611, "По-силни от любовта са копнежът по борбата и готовността за саможертва.", true, 153 },
                    { 612, "Тъжната песен на гората не може да заглуши чудния глас на девойката.", false, 153 },
                    { 613, "„Ноев ковчег“", false, 154 },
                    { 614, "„Крадецът на праскови“", true, 154 },
                    { 615, "„История“", false, 154 },
                    { 616, "„Борба“", false, 154 },
                    { 617, "„Ветрената мелница“ и „Приказка за стълбата“", false, 155 },
                    { 618, "„Песента на колелетата“ и „Балада за Георг Хених“", true, 155 },
                    { 619, "„Балада за Георг Хених“ и „Балкански синдром“", false, 155 },
                    { 620, "„Бай Ганьо журналист“ и „Песента на колелетата“", false, 155 },
                    { 621, "за размитите граници между истината и лъжата", false, 156 },
                    { 622, "за разминаването между думите и действията", false, 156 },
                    { 623, "за подмяната на ценностите в обществото", false, 156 },
                    { 624, "за осъщественото единение около обществени каузи", true, 156 },
                    { 625, "за изкуството като мост между поколенията", false, 157 },
                    { 626, "за природата като верен пазител на паметта", false, 157 },
                    { 627, "за паметта на народа за героичния подвиг", false, 157 },
                    { 628, "за паметта като осмисляне на саможертвата", true, 157 },
                    { 629, "за журналистиката като средство за материално облагодетелстване", true, 158 },
                    { 630, "за извисяването на личността чрез граждански ангажираната журналистика", false, 158 },
                    { 631, "за спасението от нравствената поквара чрез средствата на журналистиката", false, 158 },
                    { 632, "за властта като стимул за развитието на журналистиката", false, 158 },
                    { 633, "Насочват към вечните ценности на българската душевност.", false, 159 },
                    { 634, "Акцентират върху конфликта между творческата личност и родовия свят.", false, 159 },
                    { 635, "Внушават идеята за постигане на безсмъртие чрез изкуството.", true, 159 },
                    { 636, "Подчертават мястото на любимата сред изображенията в иконостаса.", false, 159 },
                    { 637, "Самочувствието, че той е новият Ной, избран да спаси живота на Земята.", false, 160 },
                    { 638, "Идеята, че е богоизбран водач на човешкия род.", false, 160 },
                    { 639, "Съзнанието, че трябва да се съхрани паметта за многоликия живот.", true, 160 },
                    { 640, "Надеждата, че чрез своя ноев ковчег ще спаси човечеството от мизерията на живота", false, 160 },
                    { 641, "Насочва към размисъл за войната като обричаща живота на безчовечност и страдание.", true, 161 },
                    { 642, "Представя обречената любов на Елисавета към сръбския военнопленник.", false, 161 },
                    { 643, "Акцентира върху отдалечеността на войната, което съхранява спокойствието в града.", false, 161 },
                    { 644, "Разкрива вътрешния конфликт между любовта към чужденеца и съпружеския дълг.", false, 161 },
                    { 645, "Както в „Потомка“, така и в „Честен кръст“ изборът на героя е заявен в изповед.", false, 162 },
                    { 646, "За разлика от „Честен кръст“ в „Две души“ изборът на героя е невъзможен.", false, 162 },
                    { 647, "Както в „Честен кръст“, така и в „Потомка“ заявеният от героите избор е категоричен.", false, 162 },
                    { 648, "За разлика от „Две души“ в „Потомка“ изборът на героинята е между сила и безсилие.", true, 162 },
                    { 649, "Утвърждава се безметежното битово съществуване на човека.", true, 163 },
                    { 650, "Отдадеността на идеала измества предаността към девойката.", false, 163 },
                    { 651, "Смъртта в битката за народна свобода е романтично красива.", false, 163 },
                    { 652, "Съпреживяното народно страдание определя избора за борба.", false, 163 },
                    { 653, "„Балкански синдром“", false, 164 },
                    { 654, "„Крадецът на праскови“", false, 164 },
                    { 655, "„Железният светилник“", true, 164 },
                    { 656, "„Балада за Георг Хених“", false, 164 },
                    { 657, "„Песента на колелетата“ и „Градушка“", false, 165 },
                    { 658, "„Спасова могила“ и „История“", false, 165 },
                    { 659, "„Крадецът на праскови“ и „Молитва“", false, 165 },
                    { 660, "„Градушка“ и „Ветрената мелница", true, 165 },
                    { 661, "тъга – радост", false, 166 },
                    { 662, "любов – омраза", true, 166 },
                    { 663, "страх – надежда", false, 166 },
                    { 664, "отчаяние – вяра", false, 166 },
                    { 665, "за избора между протеста и примирението", false, 167 },
                    { 666, "за несправедливостите в установения социален ред", true, 167 },
                    { 667, "за момента на възмездие, който неизбежно ще настъпи", false, 167 },
                    { 668, "за саможертвата в името на възвишен идеал", false, 167 },
                    { 669, "за непостижимата хармония в човешката душа", true, 168 },
                    { 670, "за драматизма на избора в един свят на разруха", false, 168 },
                    { 671, "за съмненията и надеждите на модерната душа", false, 168 },
                    { 672, "за преодолимия конфликт между доброто и злото", false, 168 },
                    { 673, "обет за вярност към християнския бог", false, 169 },
                    { 674, "клетва за изричане на изстраданата истина", true, 169 },
                    { 675, "готовност да се простят прегрешенията", false, 169 },
                    { 676, "желание за бягство от фалшивите приятели", false, 169 },
                    { 677, "Поставят акцент върху неспособността на героя да стане свещеник.", false, 170 },
                    { 678, "Разкриват узряването на героя за мисията на духовен водач.", true, 170 },
                    { 679, "Подсказват незрелостта и наивния идеализъм на Султаниния син.", false, 170 },
                    { 680, "Загатват, че героят все още търси житейското си призвание.", false, 170 },
                    { 681, "Насочва към размисъл за съдбата на онези, които водят борба за оцеляване.", false, 171 },
                    { 682, "Разкрива критичната позиция на разказвача спрямо страхливото поведение.", true, 171 },
                    { 683, "Създава смислови връзки между природното и човешко.", false, 171 },
                    { 684, "Представя природния свят в подчертано мрачни тонове.", false, 171 },
                    { 685, "И в „При Рилския манастир“, и в „Спи езерото“ природата е изобразена в своята величественост.", false, 172 },
                    { 686, "За разлика от „Спи езерото“ в „При Рилския манастир“ природата е представена като разрушителна стихия.", false, 172 },
                    { 687, "За разлика от „Спи езерото“ в „При Рилския манастир“ природата е осмислена като огледало на човешката душа.", false, 172 },
                    { 688, "И в „При Рилския манастир“, и в „Спи езерото“ е разкрита връзката между природата и човешката душа.", true, 172 },
                    { 689, "Произведението внушава отчуждението на лирическата героиня от природата.", false, 173 },
                    { 690, "Стихотворението утвърждава правото на личен избор на лирическата героиня.", true, 173 },
                    { 691, "Творбата разкрива самотата като следствие от изгубването на родовата памет.", false, 173 },
                    { 692, "Текстът представя разочарованието на лирическата героиня от изгубената любов.", false, 173 },
                    { 693, "„История“", false, 174 },
                    { 694, "„Ноев ковчег“", false, 174 },
                    { 695, "„Паисий“", true, 174 },
                    { 696, "„Потомка“", false, 174 },
                    { 697, "„До моето първо либе“ и „Новото гробище над Сливница“", true, 175 },
                    { 698, "„Честен кръст“ и „До моето първо либе“", false, 175 },
                    { 699, "„Железният светилник“ и „Спасова могила“", false, 175 },
                    { 700, "„Борба“ и „Аз искам да те помня все така“", false, 175 },
                    { 701, "за героичната саможертва", false, 176 },
                    { 702, "за свободата на човешкия дух", true, 176 },
                    { 703, "за изневярата като непростим грях", false, 176 },
                    { 704, "за значимостта на материалните ценности", false, 176 },
                    { 705, "за детското страдание във враждебния град", false, 177 },
                    { 706, "за студенината и неприветливостта на света", false, 177 },
                    { 707, "за неразбирането на децата от възрастните", false, 177 },
                    { 708, "за детската непосредственост и чистота", true, 177 },
                    { 709, "фолклорното начало в сюжета на творбата", false, 178 },
                    { 710, "смъртта на библейски старозаветен герой", false, 178 },
                    { 711, "съхраняването и пренасянето на ценното в живота", true, 178 },
                    { 712, "божия гняв, довел до построяване на Ноевия ковчег", false, 178 },
                    { 713, "Насочва към интерпретиране на социална проблематика.", false, 179 },
                    { 714, "Загатва значимостта на родовия свят в творбата.", true, 179 },
                    { 715, "Внушава принадлежност към свят на индивидуалности.", false, 179 },
                    { 716, "Подсказва острия конфликт между човека и природата.", false, 179 },
                    { 717, "Задава реторичен въпрос към виновниците за жестоката кръвопролитна война.", false, 180 },
                    { 718, "Изразява идеята за духовното безсмъртие на героите въпреки тяхната забрава.", false, 180 },
                    { 719, "Въвежда мотива за забравата на героичната саможертва на българските воини.", true, 180 },
                    { 720, "Откроява забравата на възрожденските идеали в следосвобожденското общество.", false, 180 },
                    { 721, "Както в „При Рилския манастир“, така и в „Градушка“ природата е благосклонна към човека.", false, 181 },
                    { 722, "За разлика от „Градушка“ в „При Рилския манастир“ човекът преоткрива своята хармония с природата.", true, 181 },
                    { 723, "За разлика от „При Рилския манастир“ в „Градушка“ човекът се възхищава от величието на природата.", false, 181 },
                    { 724, "Както в „Градушка“, така и в „При Рилския манастир“ Бог наказва човека чрез природата.", false, 181 },
                    { 725, "Представена е отговорността на героя пред семейството и общността.", false, 182 },
                    { 726, "Утвърден е стремежът към забогатяване като цел на съществуването.", false, 182 },
                    { 727, "Загатнат е драматичният конфликт между външния и вътрешния свят.", false, 182 },
                    { 728, "Осмислен е трудът като израз на духовната щедрост на човека.", true, 182 },
                    { 729, "„Колко си хубава!“", false, 183 },
                    { 730, "„Градушка“", false, 183 },
                    { 731, "„Спи езерото“", true, 183 },
                    { 732, "„До моето първо либе“", false, 183 },
                    { 733, "„Спи езерото“", false, 184 },
                    { 734, "„При Рилския манастир“", false, 184 },
                    { 735, "„До моето първо либе“", true, 184 },
                    { 736, "„Колко си хубава!“", false, 184 },
                    { 737, "„Железният светилник“ и „Ноев ковчег“", false, 185 },
                    { 738, "„Бай Ганьо журналист“ и „История“", false, 185 },
                    { 739, "„Потомка“ и „Новото гробище над Сливница“", false, 185 },
                    { 740, "„Новото гробище над Сливница“ и „История“", true, 185 },
                    { 741, "свобода – робство", false, 186 },
                    { 742, "водач – общество", false, 186 },
                    { 743, "човек – институция", true, 186 },
                    { 744, "идеализъм – прагматизъм", false, 186 },
                    { 745, "за страха от поемане на отговорност", false, 187 },
                    { 746, "за срамното родоотстъпничество", true, 187 },
                    { 747, "за нуждата на народа от водачество", false, 187 },
                    { 748, "за необходимостта от саможертва", false, 187 },
                    { 749, "за невъзможното щастие в любовта", false, 188 },
                    { 750, "за преобразяващата сила на любовта", true, 188 },
                    { 751, "за неизбежната раздяла в любовта", false, 188 },
                    { 752, "за красотата като извор на любовта", false, 188 },
                    { 753, "за високото пространство на спасителния подвиг", false, 189 },
                    { 754, "за почитта към чудотвореца – лечител и спасител", false, 189 },
                    { 755, "за спасението от самотата и отчуждението на човека", false, 189 },
                    { 756, "за надеждата за спасение от житейските страдания", true, 189 },
                    { 757, "Внушава примирението на лирическото „ние“ пред равнодушието на историята.", false, 190 },
                    { 758, "Подчертава иронията на лирическия говорител към историята като отживелица.", false, 190 },
                    { 759, "Изразява полемичната нагласа на лирическия говорител в диалога му с историята.", true, 190 },
                    { 760, "Разкрива идеята на лирическото „ние“, че историята е без значение, защото е остаряла.", false, 190 },
                    { 761, "Внушава тревожно и напрегнато настроение у читателя.", false, 191 },
                    { 762, "Разкрива критичната позиция на разказвача спрямо войната.", true, 191 },
                    { 763, "Създава смислови връзки между природното и човешкото.", false, 191 },
                    { 764, "Подсказва бъдещата трагична съдба на част от героите", false, 191 },
                    { 765, "Както в „До моето първо либе“, така и в „Крадецът на праскови“ любовта е представена като жизнеутвърждаваща сила.", false, 192 },
                    { 766, "За разлика от „До моето първо либе“ в „Крадецът на праскови“ саможертвата за родината е представена като най-висша човешка ценност.", false, 192 },
                    { 767, "Както в „До моето първо либе“, така и в „Крадецът на праскови“ смъртта е видяна като изход от неосъществената трагична любов.", false, 192 },
                    { 768, "За разлика от „Крадецът на праскови“ „До моето първо либе“ утвърждава юнашката смърт като път към осъществяване на свят идеал.", true, 192 },
                    { 769, "„Балкански синдром“", false, 193 },
                    { 770, "„Железният светилник“", true, 193 },
                    { 771, "„Аз искам да те помня все така“", false, 193 },
                    { 772, "„Бай Ганьо журналист“", false, 193 },
                    { 773, "„Паисий“", true, 194 },
                    { 774, "„История“", false, 194 },
                    { 775, "„Ноев ковчег“", false, 194 },
                    { 776, "„Борба“", false, 194 },
                    { 777, "„До моето първо либе“ и „Новото гробище над Сливница“", true, 195 },
                    { 778, "„Борба“ и „При Рилския манастир“", false, 195 },
                    { 779, "„Честен кръст“ и „Андрешко“", false, 195 },
                    { 780, "„Паисий“ и „Песента на колелетата“", false, 195 },
                    { 781, "водач – общество", false, 196 },
                    { 782, "примирение – борба", true, 196 },
                    { 783, "разум – съвест", false, 196 },
                    { 784, "власт – църква", false, 196 },
                    { 785, "за раздвоението на модерната душа", true, 197 },
                    { 786, "за конфликта между човека и природата", false, 197 },
                    { 787, "за връзката на човека със света", false, 197 },
                    { 788, "за избора между надеждата и отчаянието", false, 197 },
                    { 789, "за социалното страдание", false, 198 },
                    { 790, "за пиянството", false, 198 },
                    { 791, "за красотата на природата", true, 198 },
                    { 792, "за властта", false, 198 },
                    { 793, "Пресъздава атмосферата от края на Възраждането.", false, 199 },
                    { 794, "Отправя към читателя послание, лишено от патос.", false, 199 },
                    { 795, "Поставя проблема за отродилите се българи.", true, 199 },
                    { 796, "Внушава страх от непознаването на историческото минало.", false, 199 },
                    { 797, "Подчертават неспособността на героя да намери себе си и да помага на другите.", false, 200 },
                    { 798, "Разкриват прозрението на героя за търсения смисъл на благодеянието.", true, 200 },
                    { 799, "Изразяват разбирането, че героят е способен единствено да прави каруци.", false, 200 },
                    { 800, "Внушават самооценката на героя за ограничените му възможности.", false, 200 },
                    { 801, "Олицетворяването на тезгяха подсказва удовлетворението на майстора от труда.", false, 201 },
                    { 802, "Уподобяванията между стопанина и предметите са знак за хармонията в душата му.", false, 201 },
                    { 803, "Описанието изразява болката на разказвача от трагичната участ на лютиера.", true, 201 },
                    { 804, "Незапаленото кандило е знак за атеизма на майстора, вярващ само в изкуството.", false, 201 },
                    { 805, "„Потомка“", false, 202 },
                    { 806, "„Колко си хубава!“", true, 202 },
                    { 807, "„Посвещение“", false, 202 },
                    { 808, "„Спи езерото“", false, 202 },
                    { 809, "За разлика от „Крадецът на праскови“ в „До моето първо либе“ смъртта е представена като жадуван край.", true, 203 },
                    { 810, "Както в „До моето първо либе“, така и в „Крадецът на праскови“ животът на героите е подчинен на традиционните норми.", false, 203 },
                    { 811, "За разлика от „До моето първо либе“ в „Крадецът на праскови“ любовта не поставя героите пред избор.", false, 203 },
                    { 812, "Както в „Крадецът на праскови“, така и в „До моето първо либе“ смъртта не е обвързана с мотива за саможертвата.", false, 203 },
                    { 813, "„Песента на колелетата“", false, 204 },
                    { 814, "„Балада за Георг Хених“", false, 204 },
                    { 815, "„Ветрената мелница“", false, 204 },
                    { 816, "„Градушка“", true, 204 },
                    { 817, "„Спи езерото“ и „До моето първо либе“", false, 205 },
                    { 818, "„Железният светилник“ и „Паисий“", true, 205 },
                    { 819, "„Две души“ и „Балкански синдром“", false, 205 },
                    { 820, "„Спасова могила“ и „Потомка“", false, 205 },
                    { 829, "за труда", false, 208 },
                    { 830, "за вярата", true, 208 },
                    { 831, "за смъртта", false, 208 },
                    { 832, "за миналото", false, 208 },
                    { 833, "миналото и паметта", true, 209 },
                    { 834, "родното и чуждото", false, 209 },
                    { 835, "вярата и надеждата", false, 209 },
                    { 836, "животът и смъртта", false, 209 },
                    { 837, "миналото", false, 210 },
                    { 838, "любовта", false, 210 },
                    { 839, "творчеството", false, 210 },
                    { 840, "надеждата", true, 210 },
                    { 841, "изборът и раздвоението", false, 211 },
                    { 842, "трудът и творчеството", false, 211 },
                    { 843, "обществото и властта", false, 211 },
                    { 844, "миналото и паметта", true, 211 },
                    { 845, "природата", false, 212 },
                    { 846, "любовта", true, 212 },
                    { 847, "трудът", false, 212 },
                    { 848, "властта", false, 212 },
                    { 849, "трудът и творчеството", true, 213 },
                    { 850, "животът и смъртта", false, 213 },
                    { 851, "вярата и надеждата", false, 213 },
                    { 852, "изборът и раздвоението", false, 213 },
                    { 853, "за миналото и паметта", false, 214 },
                    { 854, "за вярата и надеждата", false, 214 },
                    { 855, "за избора и раздвоението", false, 214 },
                    { 856, "за живота и смъртта", true, 214 },
                    { 857, "природата", false, 215 },
                    { 858, "вярата и надеждата", false, 215 },
                    { 859, "любовта", true, 215 },
                    { 860, "родното и чуждото", false, 215 }
                });

            migrationBuilder.InsertData(
                table: "QuestionPassages",
                columns: new[] { "PassageId", "QuestionId" },
                values: new object[,]
                {
                    { 5, 76 },
                    { 6, 76 },
                    { 7, 80 },
                    { 8, 80 },
                    { 9, 84 },
                    { 10, 84 },
                    { 11, 88 },
                    { 12, 88 },
                    { 13, 92 },
                    { 14, 92 },
                    { 15, 96 },
                    { 16, 96 },
                    { 17, 100 },
                    { 18, 100 },
                    { 19, 104 },
                    { 20, 104 }
                });
        }

        /// <inheritdoc />
        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 49);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 50);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 51);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 52);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 53);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 54);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 55);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 56);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 57);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 58);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 59);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 60);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 61);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 62);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 63);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 64);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 65);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 66);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 67);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 68);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 69);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 70);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 71);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 72);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 73);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 74);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 75);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 76);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 77);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 78);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 79);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 80);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 81);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 82);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 83);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 84);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 85);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 86);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 87);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 88);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 89);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 90);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 91);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 92);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 93);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 94);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 95);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 96);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 97);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 98);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 99);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 100);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 101);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 102);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 103);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 104);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 105);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 106);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 107);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 108);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 109);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 110);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 111);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 112);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 113);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 114);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 115);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 116);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 117);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 118);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 119);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 120);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 121);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 122);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 123);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 124);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 125);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 126);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 127);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 128);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 129);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 130);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 131);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 132);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 133);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 134);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 135);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 136);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 137);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 138);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 139);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 140);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 141);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 142);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 143);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 144);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 145);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 146);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 147);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 148);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 149);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 150);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 151);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 152);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 153);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 154);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 155);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 156);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 157);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 158);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 159);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 160);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 161);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 162);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 163);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 164);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 165);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 166);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 167);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 168);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 169);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 170);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 171);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 172);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 173);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 174);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 175);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 176);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 177);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 178);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 179);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 180);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 181);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 182);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 183);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 184);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 185);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 186);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 187);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 188);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 189);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 190);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 191);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 192);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 193);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 194);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 195);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 196);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 197);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 198);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 199);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 200);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 201);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 202);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 203);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 204);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 205);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 206);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 207);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 208);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 209);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 210);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 211);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 212);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 213);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 214);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 215);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 216);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 217);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 218);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 219);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 220);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 221);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 222);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 223);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 224);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 225);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 226);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 227);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 228);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 229);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 230);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 231);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 232);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 233);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 234);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 235);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 236);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 237);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 238);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 239);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 240);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 241);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 242);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 243);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 244);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 245);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 246);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 247);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 248);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 249);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 250);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 251);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 252);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 253);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 254);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 255);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 256);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 257);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 258);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 259);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 260);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 261);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 262);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 263);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 264);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 265);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 266);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 267);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 268);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 269);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 270);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 271);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 272);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 273);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 274);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 275);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 276);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 277);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 278);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 279);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 280);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 281);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 282);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 283);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 284);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 285);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 286);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 287);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 288);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 289);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 290);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 291);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 292);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 293);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 294);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 295);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 296);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 297);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 298);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 299);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 300);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 301);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 302);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 303);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 304);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 305);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 306);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 307);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 308);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 309);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 310);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 311);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 312);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 313);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 314);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 315);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 316);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 317);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 318);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 319);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 320);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 321);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 322);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 323);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 324);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 325);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 326);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 327);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 328);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 329);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 330);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 331);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 332);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 333);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 334);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 335);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 336);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 337);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 338);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 339);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 340);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 341);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 342);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 343);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 344);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 345);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 346);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 347);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 348);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 349);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 350);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 351);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 352);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 353);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 354);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 355);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 356);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 357);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 358);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 359);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 360);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 361);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 362);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 363);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 364);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 365);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 366);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 367);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 368);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 369);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 370);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 371);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 372);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 373);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 374);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 375);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 376);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 377);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 378);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 379);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 380);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 381);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 382);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 383);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 384);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 385);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 386);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 387);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 388);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 389);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 390);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 391);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 392);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 393);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 394);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 395);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 396);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 397);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 398);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 399);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 400);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 401);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 402);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 403);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 404);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 405);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 406);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 407);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 408);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 409);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 410);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 411);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 412);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 413);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 414);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 415);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 416);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 417);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 418);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 419);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 420);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 421);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 422);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 423);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 424);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 425);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 426);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 427);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 428);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 429);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 430);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 431);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 432);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 433);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 434);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 435);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 436);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 437);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 438);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 439);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 440);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 441);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 442);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 443);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 444);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 445);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 446);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 447);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 448);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 449);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 450);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 451);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 452);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 453);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 454);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 455);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 456);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 457);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 458);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 459);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 460);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 461);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 462);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 463);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 464);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 465);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 466);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 467);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 468);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 469);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 470);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 471);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 472);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 473);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 474);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 475);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 476);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 477);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 478);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 479);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 480);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 481);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 482);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 483);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 484);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 485);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 486);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 487);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 488);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 489);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 490);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 491);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 492);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 493);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 494);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 495);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 496);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 497);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 498);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 499);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 500);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 501);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 502);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 503);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 504);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 505);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 506);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 507);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 508);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 509);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 510);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 511);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 512);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 513);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 514);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 515);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 516);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 517);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 518);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 519);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 520);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 521);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 522);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 523);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 524);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 525);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 526);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 527);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 528);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 529);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 530);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 531);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 532);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 533);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 534);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 535);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 536);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 537);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 538);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 539);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 540);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 541);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 542);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 543);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 544);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 545);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 546);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 547);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 548);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 549);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 550);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 551);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 552);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 553);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 554);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 555);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 556);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 557);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 558);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 559);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 560);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 561);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 562);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 563);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 564);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 565);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 566);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 567);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 568);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 569);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 570);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 571);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 572);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 573);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 574);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 575);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 576);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 577);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 578);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 579);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 580);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 581);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 582);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 583);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 584);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 585);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 586);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 587);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 588);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 589);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 590);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 591);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 592);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 593);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 594);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 595);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 596);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 597);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 598);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 599);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 600);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 601);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 602);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 603);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 604);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 605);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 606);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 607);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 608);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 609);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 610);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 611);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 612);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 613);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 614);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 615);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 616);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 617);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 618);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 619);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 620);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 621);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 622);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 623);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 624);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 625);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 626);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 627);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 628);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 629);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 630);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 631);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 632);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 633);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 634);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 635);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 636);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 637);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 638);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 639);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 640);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 641);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 642);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 643);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 644);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 645);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 646);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 647);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 648);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 649);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 650);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 651);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 652);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 653);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 654);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 655);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 656);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 657);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 658);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 659);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 660);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 661);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 662);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 663);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 664);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 665);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 666);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 667);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 668);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 669);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 670);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 671);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 672);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 673);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 674);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 675);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 676);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 677);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 678);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 679);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 680);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 681);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 682);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 683);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 684);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 685);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 686);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 687);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 688);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 689);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 690);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 691);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 692);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 693);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 694);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 695);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 696);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 697);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 698);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 699);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 700);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 701);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 702);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 703);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 704);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 705);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 706);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 707);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 708);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 709);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 710);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 711);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 712);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 713);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 714);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 715);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 716);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 717);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 718);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 719);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 720);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 721);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 722);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 723);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 724);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 725);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 726);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 727);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 728);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 729);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 730);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 731);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 732);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 733);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 734);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 735);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 736);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 737);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 738);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 739);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 740);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 741);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 742);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 743);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 744);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 745);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 746);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 747);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 748);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 749);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 750);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 751);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 752);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 753);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 754);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 755);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 756);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 757);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 758);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 759);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 760);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 761);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 762);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 763);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 764);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 765);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 766);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 767);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 768);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 769);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 770);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 771);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 772);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 773);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 774);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 775);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 776);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 777);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 778);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 779);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 780);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 781);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 782);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 783);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 784);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 785);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 786);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 787);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 788);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 789);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 790);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 791);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 792);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 793);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 794);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 795);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 796);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 797);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 798);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 799);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 800);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 801);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 802);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 803);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 804);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 805);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 806);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 807);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 808);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 809);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 810);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 811);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 812);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 813);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 814);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 815);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 816);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 817);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 818);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 819);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 820);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 821);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 822);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 823);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 824);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 825);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 826);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 827);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 828);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 829);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 830);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 831);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 832);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 833);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 834);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 835);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 836);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 837);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 838);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 839);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 840);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 841);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 842);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 843);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 844);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 845);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 846);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 847);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 848);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 849);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 850);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 851);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 852);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 853);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 854);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 855);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 856);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 857);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 858);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 859);

            migrationBuilder.DeleteData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 860);

            migrationBuilder.DeleteData(
                table: "QuestionPassages",
                keyColumns: new[] { "PassageId", "QuestionId" },
                keyValues: new object[] { 1, 68 });

            migrationBuilder.DeleteData(
                table: "QuestionPassages",
                keyColumns: new[] { "PassageId", "QuestionId" },
                keyValues: new object[] { 2, 68 });

            migrationBuilder.DeleteData(
                table: "QuestionPassages",
                keyColumns: new[] { "PassageId", "QuestionId" },
                keyValues: new object[] { 3, 72 });

            migrationBuilder.DeleteData(
                table: "QuestionPassages",
                keyColumns: new[] { "PassageId", "QuestionId" },
                keyValues: new object[] { 4, 72 });

            migrationBuilder.DeleteData(
                table: "QuestionPassages",
                keyColumns: new[] { "PassageId", "QuestionId" },
                keyValues: new object[] { 5, 76 });

            migrationBuilder.DeleteData(
                table: "QuestionPassages",
                keyColumns: new[] { "PassageId", "QuestionId" },
                keyValues: new object[] { 6, 76 });

            migrationBuilder.DeleteData(
                table: "QuestionPassages",
                keyColumns: new[] { "PassageId", "QuestionId" },
                keyValues: new object[] { 7, 80 });

            migrationBuilder.DeleteData(
                table: "QuestionPassages",
                keyColumns: new[] { "PassageId", "QuestionId" },
                keyValues: new object[] { 8, 80 });

            migrationBuilder.DeleteData(
                table: "QuestionPassages",
                keyColumns: new[] { "PassageId", "QuestionId" },
                keyValues: new object[] { 9, 84 });

            migrationBuilder.DeleteData(
                table: "QuestionPassages",
                keyColumns: new[] { "PassageId", "QuestionId" },
                keyValues: new object[] { 10, 84 });

            migrationBuilder.DeleteData(
                table: "QuestionPassages",
                keyColumns: new[] { "PassageId", "QuestionId" },
                keyValues: new object[] { 11, 88 });

            migrationBuilder.DeleteData(
                table: "QuestionPassages",
                keyColumns: new[] { "PassageId", "QuestionId" },
                keyValues: new object[] { 12, 88 });

            migrationBuilder.DeleteData(
                table: "QuestionPassages",
                keyColumns: new[] { "PassageId", "QuestionId" },
                keyValues: new object[] { 13, 92 });

            migrationBuilder.DeleteData(
                table: "QuestionPassages",
                keyColumns: new[] { "PassageId", "QuestionId" },
                keyValues: new object[] { 14, 92 });

            migrationBuilder.DeleteData(
                table: "QuestionPassages",
                keyColumns: new[] { "PassageId", "QuestionId" },
                keyValues: new object[] { 15, 96 });

            migrationBuilder.DeleteData(
                table: "QuestionPassages",
                keyColumns: new[] { "PassageId", "QuestionId" },
                keyValues: new object[] { 16, 96 });

            migrationBuilder.DeleteData(
                table: "QuestionPassages",
                keyColumns: new[] { "PassageId", "QuestionId" },
                keyValues: new object[] { 17, 100 });

            migrationBuilder.DeleteData(
                table: "QuestionPassages",
                keyColumns: new[] { "PassageId", "QuestionId" },
                keyValues: new object[] { 18, 100 });

            migrationBuilder.DeleteData(
                table: "QuestionPassages",
                keyColumns: new[] { "PassageId", "QuestionId" },
                keyValues: new object[] { 19, 104 });

            migrationBuilder.DeleteData(
                table: "QuestionPassages",
                keyColumns: new[] { "PassageId", "QuestionId" },
                keyValues: new object[] { 20, 104 });

            migrationBuilder.DeleteData(
                table: "Passages",
                keyColumn: "Id",
                keyValue: 5);

            migrationBuilder.DeleteData(
                table: "Passages",
                keyColumn: "Id",
                keyValue: 6);

            migrationBuilder.DeleteData(
                table: "Passages",
                keyColumn: "Id",
                keyValue: 7);

            migrationBuilder.DeleteData(
                table: "Passages",
                keyColumn: "Id",
                keyValue: 8);

            migrationBuilder.DeleteData(
                table: "Passages",
                keyColumn: "Id",
                keyValue: 9);

            migrationBuilder.DeleteData(
                table: "Passages",
                keyColumn: "Id",
                keyValue: 10);

            migrationBuilder.DeleteData(
                table: "Passages",
                keyColumn: "Id",
                keyValue: 11);

            migrationBuilder.DeleteData(
                table: "Passages",
                keyColumn: "Id",
                keyValue: 12);

            migrationBuilder.DeleteData(
                table: "Passages",
                keyColumn: "Id",
                keyValue: 13);

            migrationBuilder.DeleteData(
                table: "Passages",
                keyColumn: "Id",
                keyValue: 14);

            migrationBuilder.DeleteData(
                table: "Passages",
                keyColumn: "Id",
                keyValue: 15);

            migrationBuilder.DeleteData(
                table: "Passages",
                keyColumn: "Id",
                keyValue: 16);

            migrationBuilder.DeleteData(
                table: "Passages",
                keyColumn: "Id",
                keyValue: 17);

            migrationBuilder.DeleteData(
                table: "Passages",
                keyColumn: "Id",
                keyValue: 18);

            migrationBuilder.DeleteData(
                table: "Passages",
                keyColumn: "Id",
                keyValue: 19);

            migrationBuilder.DeleteData(
                table: "Passages",
                keyColumn: "Id",
                keyValue: 20);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 13);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 14);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 15);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 16);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 17);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 18);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 19);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 20);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 21);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 22);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 23);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 24);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 25);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 26);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 27);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 28);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 29);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 30);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 31);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 32);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 33);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 34);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 35);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 36);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 37);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 38);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 39);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 40);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 41);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 42);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 43);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 44);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 45);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 46);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 47);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 48);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 49);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 50);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 51);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 52);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 53);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 54);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 55);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 56);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 57);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 58);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 59);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 60);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 61);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 62);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 63);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 64);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 65);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 66);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 67);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 68);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 69);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 70);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 71);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 72);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 73);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 74);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 75);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 76);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 77);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 78);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 79);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 80);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 81);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 82);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 83);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 84);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 85);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 86);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 87);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 88);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 89);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 90);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 91);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 92);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 93);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 94);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 95);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 96);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 97);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 98);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 99);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 100);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 101);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 102);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 103);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 104);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 105);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 106);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 107);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 108);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 109);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 110);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 111);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 112);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 113);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 114);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 115);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 116);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 117);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 118);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 119);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 120);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 121);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 122);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 123);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 124);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 125);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 126);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 127);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 128);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 129);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 130);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 131);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 132);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 133);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 134);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 135);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 136);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 137);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 138);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 139);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 140);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 141);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 142);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 143);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 144);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 145);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 146);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 147);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 148);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 149);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 150);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 151);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 152);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 153);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 154);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 155);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 156);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 157);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 158);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 159);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 160);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 161);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 162);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 163);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 164);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 165);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 166);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 167);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 168);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 169);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 170);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 171);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 172);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 173);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 174);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 175);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 176);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 177);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 178);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 179);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 180);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 181);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 182);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 183);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 184);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 185);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 186);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 187);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 188);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 189);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 190);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 191);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 192);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 193);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 194);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 195);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 196);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 197);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 198);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 199);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 200);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 201);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 202);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 203);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 204);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 205);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 206);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 207);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 208);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 209);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 210);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 211);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 212);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 213);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 214);

            migrationBuilder.DeleteData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 215);

            migrationBuilder.DeleteData(
                table: "ExamSessions",
                keyColumn: "Id",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "ExamSessions",
                keyColumn: "Id",
                keyValue: 4);

            migrationBuilder.DeleteData(
                table: "ExamSessions",
                keyColumn: "Id",
                keyValue: 5);

            migrationBuilder.DeleteData(
                table: "ExamSessions",
                keyColumn: "Id",
                keyValue: 6);

            migrationBuilder.DeleteData(
                table: "ExamSessions",
                keyColumn: "Id",
                keyValue: 7);

            migrationBuilder.DeleteData(
                table: "ExamSessions",
                keyColumn: "Id",
                keyValue: 8);

            migrationBuilder.DeleteData(
                table: "ExamSessions",
                keyColumn: "Id",
                keyValue: 9);

            migrationBuilder.DeleteData(
                table: "ExamSessions",
                keyColumn: "Id",
                keyValue: 10);

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 5,
                column: "Content",
                value: "вариянт");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 6,
                columns: new[] { "Content", "IsCorrect" },
                values: new object[] { "уредник", true });

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 7,
                column: "Content",
                value: "съвременици");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 8,
                columns: new[] { "Content", "IsCorrect" },
                values: new object[] { "потчертавам", false });

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 9,
                columns: new[] { "Content", "IsCorrect" },
                values: new object[] { "Още с дебютната си роля младата актриса спечели симпатиите на публиката.", true });

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 10,
                column: "Content",
                value: "Ще поставим на обществено обсъждане още два много сериозни проблеми.");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 11,
                column: "Content",
                value: "Новия роман на писателя може да бъде закупен с отстъпка до края на месеца.");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 12,
                columns: new[] { "Content", "IsCorrect" },
                values: new object[] { "Човешкото ухо има способността да разграничава високите и ниски тонове.", false });

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 13,
                columns: new[] { "Content", "IsCorrect" },
                values: new object[] { "След премиерата актрисата благодари на своите почитатели.", true });

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 14,
                column: "Content",
                value: "Във фестивала участваха десет танцови състави от цялата страна.");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 15,
                columns: new[] { "Content", "IsCorrect" },
                values: new object[] { "Пълният текст на доклада ще публикуваме скоро на нашия сайт.", false });

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 16,
                column: "Content",
                value: "Спектакълът зарадва ценителите на балетното и оперно изкуство.");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 17,
                column: "Content",
                value: "Мусоните са характерни както за части от Азия така и за части от Австралия.");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 18,
                column: "Content",
                value: "Вацлав Хавел, първият президент на Чехия е автор на около двадесет пиеси.");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 19,
                columns: new[] { "Content", "IsCorrect" },
                values: new object[] { "Госпожо Иванова поръчаният от Вас продукт е пристигнал в офиса на фирмата.", false });

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 20,
                columns: new[] { "Content", "IsCorrect" },
                values: new object[] { "Божурът е символ на успеха, богатството и любовта, както и на благополучието.", true });

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 21,
                column: "Content",
                value: "Цветовата гама от жълти, сини и зелени тонове, се допълва с бяло и виолетово.");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 22,
                column: "Content",
                value: "Януарският сняг направи непроходим единствения път, водещ към малкото село.");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 23,
                column: "Content",
                value: "Уважаеми господин Пантелеев, най-сърдечно Ви поздравяваме с Вашия юбилей!");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 24,
                column: "Content",
                value: "Необходимо е декларацията да се подпише или от бащата, или от майката на ученика.");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 25,
                column: "Content",
                value: "Възможността набързо да се запознаят с нещо забавно и вдъхновяващо.");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 26,
                columns: new[] { "Content", "IsCorrect" },
                values: new object[] { "Лесният достъп до различни дигитални платформи за видеосподеляне.", false });

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 27,
                columns: new[] { "Content", "IsCorrect" },
                values: new object[] { "Удобството за няколко минути да научат най-важното от учебния материал.", true });

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 28,
                column: "Content",
                value: "Мигновеното развлечение от гледането на разнообразни забавни ситуации.");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 29,
                columns: new[] { "Content", "IsCorrect" },
                values: new object[] { "Ако хората спортуват поне по 150 минути седмично, ще живеят по-дълго.", true });

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 30,
                column: "Content",
                value: "За да се излекуват от хронични заболявания, хората трябва да спортуват.");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 31,
                columns: new[] { "Content", "IsCorrect" },
                values: new object[] { "Редовно спортуващите е изключено да получат травми, докато тренират.", false });

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 32,
                column: "Content",
                value: "Спортът оказва благотворно влияние единствено върху физическото здраве.");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 33,
                column: "Content",
                value: "за закъснялата слава на майстора");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 34,
                columns: new[] { "Content", "IsCorrect" },
                values: new object[] { "за творческата немощ на стария човек", false });

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 35,
                column: "Content",
                value: "за богоборческата дързост на твореца");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 36,
                columns: new[] { "Content", "IsCorrect" },
                values: new object[] { "за бездуховността на обществото", true });

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 37,
                column: "Content",
                value: "приятелство – предателство");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 38,
                column: "Content",
                value: "живот – смърт");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 39,
                columns: new[] { "Content", "IsCorrect" },
                values: new object[] { "замисъл – реализация", false });

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 40,
                columns: new[] { "Content", "IsCorrect" },
                values: new object[] { "състрадание – безразличие", true });

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 41,
                column: "Content",
                value: "за природата");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 42,
                column: "Content",
                value: "за труда и творчеството");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 43,
                column: "Content",
                value: "за живота и смъртта");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 44,
                column: "Content",
                value: "за раздвоението");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 45,
                columns: new[] { "Content", "IsCorrect" },
                values: new object[] { "за труда", false });

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 46,
                columns: new[] { "Content", "IsCorrect" },
                values: new object[] { "за вярата", true });

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 47,
                column: "Content",
                value: "за смъртта");

            migrationBuilder.UpdateData(
                table: "Answers",
                keyColumn: "Id",
                keyValue: 48,
                column: "Content",
                value: "за миналото");

            migrationBuilder.UpdateData(
                table: "ExamSessions",
                keyColumn: "Id",
                keyValue: 2,
                columns: new[] { "Session", "Year" },
                values: new object[] { "May", 2025 });

            migrationBuilder.UpdateData(
                table: "Passages",
                keyColumn: "Id",
                keyValue: 2,
                column: "ImagePath",
                value: "/images/texts/text2026.png");

            migrationBuilder.UpdateData(
                table: "Passages",
                keyColumn: "Id",
                keyValue: 3,
                column: "Content",
                value: "Спортните занимания са важен фактор за постигане на добро физическо и психическо здраве. Според данните на Световната здравна организация при хората, които спортуват поне 150 минути седмично, има значително по-нисък риск от хронични заболявания и преждевременна смърт. Въпреки това заниманията със спорт имат и своите предизвикателства. Много специалисти предупреждават, че неправилната техника на изпълнение на упражненията, 3 прекомерното натоварване и омаловажаването на възстановителните периоди могат да доведат до сериозни травми. Скорошно изследване сочи, че около 30% от редовно спортуващите получават травми, които са резултат от липсата на загряване преди тренировка. Според експертите по спортна медицина съревнованието с другите спортуващи в залата често подтиква хората да надценяват възможностите си, което увеличава риска от дълготрайни увреждания. Съществуват и някои погрешни схващания около спортуването. Широко разпространено например е мнението, че тичането може да се практикува от всички. Ако човек обаче е с тегло дори и малко над нормата, рискът от травми е много по-голям. При бягане ставите на краката трябва да издържат на натоварване, което се равнява на утроеното собствено тегло. Друго разпространено схващане е, че разходката не е спорт. Данни от изследване обаче свидетелстват, че четири кратки разходки на ден са по-полезни от продължителен джогинг както за кръвообрaщението и работата на сърцето, така и за намаляването на високото кръвно налягане. Доказано е също така, че ако се изминават пеша кратки отсечки от по един километър, проблемите със съня намаляват наполовина. Танцуването пък се оказва, че е едно от най-ефективните и същевременно найполезните за гърба спортни занимания. Гръбначните мускули се стабилизират, а тялото изгаря за час танцуване около 600 килокалории. Редовните занимания с танци намаляват със 76% риска от деменция, сочи изследване. Народните танци например не само укрепват здравето – те съхраняват и културната идентичност чрез връзката с фолклора и обичаите. Някои експерти смятат обаче, че спортуването е само една част от здравословния начин на живот. Според повечето диетолози правилното хранене и качественият сън са не по-малко важни. Физическата активност може да подобри здравето, но без балансиран хранителен режим и без достатъчно почивка усилията може да бъдат напразни.");

            migrationBuilder.UpdateData(
                table: "Passages",
                keyColumn: "Id",
                keyValue: 4,
                column: "ImagePath",
                value: "/images/texts/text2025.png");

            migrationBuilder.InsertData(
                table: "QuestionPassages",
                columns: new[] { "PassageId", "QuestionId" },
                values: new object[,]
                {
                    { 1, 7 },
                    { 2, 7 },
                    { 3, 8 },
                    { 4, 8 }
                });

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 2,
                columns: new[] { "Content", "ExamSessionId" },
                values: new object[] { "В кой ред думата е изписана правилно?", 2 });

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 3,
                columns: new[] { "Content", "QuestionTypeId" },
                values: new object[] { "В кое изречение НЕ е допусната граматична грешка?", 2 });

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 4,
                columns: new[] { "Content", "QuestionTypeId" },
                values: new object[] { "В кое изречение НЕ е допусната граматична грешка?", 2 });

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 5,
                columns: new[] { "Content", "ExamSessionId", "QuestionTypeId" },
                values: new object[] { "В кое изречение НЕ е допусната пунктуационна грешка?", 1, 3 });

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 6,
                columns: new[] { "Content", "QuestionTypeId" },
                values: new object[] { "В кое изречение е допусната пунктуационна грешка?", 3 });

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 7,
                columns: new[] { "Content", "ExamSessionId", "QuestionTypeId" },
                values: new object[] { "Кое НЕ стимулира младите хора да гледат кратки видеа според Текст 1?", 1, 4 });

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 8,
                columns: new[] { "Content", "ExamSessionId", "QuestionTypeId" },
                values: new object[] { "Кое е вярно за спортуването според Текст 1?", 2, 4 });

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 9,
                columns: new[] { "Content", "ExamSessionId", "QuestionTypeId" },
                values: new object[] { "Кой проблем е заложен в интерпретацията на темата за творчеството в „Балада за Георг Хених“?", 1, 5 });

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 10,
                columns: new[] { "Content", "ExamSessionId", "QuestionTypeId" },
                values: new object[] { "Кой конфликт е заложен в интерпретацията на темата за човека и властта в „Андрешко“?", 2, 5 });

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 11,
                columns: new[] { "Content", "ExamSessionId", "QuestionTypeId" },
                values: new object[] { "Коя тема е интерпретирана в откъса от стихотворението „И пак на дъщеря ми“ на Станка Пенчева? \r\nОт всяко свое пътуване \r\nвсе ти носех по нещо – да те зарадвам, \r\nда усетиш дъха на далечините. \r\nКак обичах завръщането, \r\nпрегръдката ни по летища и гари, \r\nразговорите до среднощ... \r\nТози път,\r\n от най-далечното свое пътуване \r\nняма нищичко да ти донеса.\r\n Само – болка и сиротство, \r\nсамо – заглъхващ спомен \r\nза лицето ми, за гласа, \r\nза облака от любов,\r\n с който те обгръщах... \r\nНикога нищо няма да узнаеш \r\nза най-странното мое пътуване.", 1, 6 });

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 12,
                columns: new[] { "Content", "ExamSessionId", "QuestionTypeId" },
                values: new object[] { "Коя тема е интерпретирана в откъса от „Дон Кихоте, близко е Ла Манча!“ на Дамян Дамянов? \r\nДон Кихоте, близко е Ла Манча! \r\nОще малко! Там сме! Още ден! \r\nНищо че ни вразумява Санчо \r\nи че Росинант е уморен! \r\nНищо че заплашват като хора \r\nмелници от вятър и стада.\r\n Нищо че от многото умора \r\nвсе ни се привижда зла беда! \r\nНищо че какви не идиоти \r\nтеб и мен наричат „идиот“!\r\n Ще ги надживеем, Дон Кихоте! \r\nАко не със друго – с цял живот! \r\nС цяла вечност, ако не със друго! \r\nС път красив, на рицарства богат! \r\nНа света, ако не съществуват „луди“, \r\nможе въобще да няма свят.", 2, 6 });
        }
    }
}
