using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

namespace LiteratureSolitaire.Infrastructure.Migrations
{
    /// <inheritdoc />
    public partial class UpdatedPunctuationQuestions : Migration
    {
        /// <inheritdoc />
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 216,
                column: "Content",
                value: "В текста са пропуснати САМО ПЕТ препинателни знака. Поставете пропуснатите знаци.\r\nПремиерата на документалния филм Милен, проследяващ живота на журналиста Милен Цветков се състоя през 2025 г. Лентата разказва за развитието на публицистиката у нас през последните три десетилетия като свободата на словото е основна тема. Филмът се фокусира върху събитията които са променили медийната среда и върху постиженията на българската журналистика.");

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 217,
                column: "Content",
                value: "В текста са пропуснати САМО ПЕТ препинателни знака. Поставете пропуснатите знаци.\r\nСпектакълът Сън в лятна нощ, който се играе в Младежкия театър е своеобразно пътуване между любовта и илюзията. В своята интерпретация на Шекспировата комедия Диана Добрева, режисьор на постановката създава завладяващ спектакъл в който класическият текст се съчетава със съвременна естетика за да акцентира върху темата за човешките копнежи.");

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 218,
                column: "Content",
                value: "В текста са пропуснати САМО ПЕТ препинателни знака. Поставете пропуснатите знаци.\r\nРоманът Граф Монте Кристо е истинско литературно приключение което пленява читателя от първата до последната страница. Историята, изпълнена с интриги, предателства и стремеж към възмездие разгръща сложни човешки съдби. Стилът на Александър Дюма е богат и увлекателен а умението му да съчетава напрежение и емоции прави романа незабравим.");

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 219,
                column: "Content",
                value: "В текста са пропуснати САМО ПЕТ препинателни знака. Поставете пропуснатите знаци.\r\nВ Осъдени души се разказва за драматичната любов между Фани Хорн и отец Ередия. Фани, героиня с необичайна житейска съдба изпитва дълбоки вътрешни противоречия които я водят към трагичен край. Въпреки че сюжетът се развива в контекста на Гражданската война в Испания романът надхвърля рамките на епохата. Историята е вълнуваща и завладяваща като същевременно насочва вниманието към сложността на живота.");

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 220,
                column: "Content",
                value: "В текста са пропуснати САМО ПЕТ препинателни знака. Поставете пропуснатите знаци.\r\nАни Ерно е носителка на Нобеловата награда за литература. Преди да стане писателка тя е била учителка. Романът, с който спечелва международна известност е Годините. Преплитайки лични преживявания и спомени авторката разказва историята на цяло едно поколение чийто живот протича от Втората световна война до наши дни.");

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 221,
                column: "Content",
                value: "В текста са пропуснати САМО ПЕТ препинателни знака. Поставете пропуснатите знаци.\r\nАко се занимавате с дигитален маркетинг преди да напишете свой текст, помислете към кого точно отправяте посланието си. Иван Петров, експерт с дългогодишен опит в тази област съветва Подбирайте думи, които ще породят емоции у читателя без да изпадате в многословие.");

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 222,
                column: "Content",
                value: "В текста са пропуснати САМО ПЕТ препинателни знака. Поставете пропуснатите знаци.\r\nПриказките на Андерсен, изпълнени с дълбоки чувства продължават да вълнуват и до днес. С творчеството си писателят донася голяма слава на своята страна затова в столицата на Дания е издигнат паметник, превърнал се в символ на Копенхаген какъвто е и бронзовата фигура на Малката русалка. Най-авторитетното международно отличие, което се присъжда на автор или илюстратор на детска литература е наградата Ханс Кристиан Андерсен.");

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 223,
                column: "Content",
                value: "В текста са пропуснати САМО ПЕТ препинателни знака. Поставете пропуснатите знаци.\r\nВ света на медицината т.нар. „бабини рецепти“ обикновено се свързват със суеверие. Оказва се обаче че доста от тях представляват интерес за съвременната наука доказателство за което е и книгата Бабини деветини. Използвайки най-новите изследвания авторът ѝ проучва повече от петдесет народни суеверия за да помогне на читателя да се ориентира кое е истина и кое – измислица.");

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 224,
                column: "Content",
                value: "В текста са пропуснати САМО ПЕТ препинателни знака. Поставете пропуснатите знаци.\r\nДебютът ѝ в киното е през 1924 г. когато е само на деветнайсет. Не кой да е, а самият Робърт Вине я взема за ролята на младо девойче във филма си, озаглавен Имах един приятел. Играла под псевдонима Ива-Ваня младата българка се справя отлично. И критиците и зрителите много я харесват поради което продуценти и режисьори бързат да я ангажират за нови роли.");

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 225,
                column: "Content",
                value: "В текста са пропуснати САМО ПЕТ препинателни знака. Поставете пропуснатите знаци.\r\nСава Огнянов е първородният син на Мина Горанова, на която Ботев посвещава творбата си Пристанала. Но за да я откъсне от поета баща ѝ я праща в Прага да учи пеене, а след това я омъжва за котленеца Петър Огнянов. По-късно Ботев споделя че е имал любима породила у него страстна любов угаснала тъй рано.");
        }

        /// <inheritdoc />
        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 216,
                column: "Content",
                value: "В текста са пропуснати САМО ПЕТ препинателни знака. Препишете целия текст в листа за отговори, като поставите пропуснатите знаци.\r\nПремиерата на документалния филм Милен, проследяващ живота на журналиста Милен Цветков се състоя през 2025 г. Лентата разказва за развитието на публицистиката у нас през последните три десетилетия като свободата на словото е основна тема. Филмът се фокусира върху събитията които са променили медийната среда и върху постиженията на българската журналистика.");

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 217,
                column: "Content",
                value: "В текста са пропуснати САМО ПЕТ препинателни знака. Препишете текста в листа за отговори, като поставите пропуснатите знаци.\r\nСпектакълът Сън в лятна нощ, който се играе в Младежкия театър е своеобразно пътуване между любовта и илюзията. В своята интерпретация на Шекспировата комедия Диана Добрева, режисьор на постановката създава завладяващ спектакъл в който класическият текст се съчетава със съвременна естетика за да акцентира върху темата за човешките копнежи.");

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 218,
                column: "Content",
                value: "В текста са пропуснати САМО ПЕТ препинателни знака. Препишете ЦЕЛИЯ текст в листа за отговори, като поставите пропуснатите знаци.\r\nРоманът Граф Монте Кристо е истинско литературно приключение което пленява читателя от първата до последната страница. Историята, изпълнена с интриги, предателства и стремеж към възмездие разгръща сложни човешки съдби. Стилът на Александър Дюма е богат и увлекателен а умението му да съчетава напрежение и емоции прави романа незабравим.");

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 219,
                column: "Content",
                value: "В текста са пропуснати САМО ПЕТ препинателни знака. Препишете ЦЕЛИЯ текст в листа за отговори, като поставите пропуснатите знаци.\r\nВ Осъдени души се разказва за драматичната любов между Фани Хорн и отец Ередия. Фани, героиня с необичайна житейска съдба изпитва дълбоки вътрешни противоречия които я водят към трагичен край. Въпреки че сюжетът се развива в контекста на Гражданската война в Испания романът надхвърля рамките на епохата. Историята е вълнуваща и завладяваща като същевременно насочва вниманието към сложността на живота.");

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 220,
                column: "Content",
                value: "В текста са пропуснати САМО ПЕТ препинателни знака. Препишете текста в листа за отговори, като поставите пропуснатите знаци.\r\nАни Ерно е носителка на Нобеловата награда за литература. Преди да стане писателка тя е била учителка. Романът, с който спечелва международна известност е Годините. Преплитайки лични преживявания и спомени авторката разказва историята на цяло едно поколение чийто живот протича от Втората световна война до наши дни.");

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 221,
                column: "Content",
                value: "В текста са пропуснати САМО ПЕТ препинателни знака. Препишете текста в листа за отговори, като поставите пропуснатите знаци.\r\nАко се занимавате с дигитален маркетинг преди да напишете свой текст, помислете към кого точно отправяте посланието си. Иван Петров, експерт с дългогодишен опит в тази област съветва Подбирайте думи, които ще породят емоции у читателя без да изпадате в многословие.");

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 222,
                column: "Content",
                value: "В текста са пропуснати САМО ПЕТ препинателни знака. Препишете целия текст в листа за отговори, като поставите пропуснатите знаци.\r\nПриказките на Андерсен, изпълнени с дълбоки чувства продължават да вълнуват и до днес. С творчеството си писателят донася голяма слава на своята страна затова в столицата на Дания е издигнат паметник, превърнал се в символ на Копенхаген какъвто е и бронзовата фигура на Малката русалка. Най-авторитетното международно отличие, което се присъжда на автор или илюстратор на детска литература е наградата Ханс Кристиан Андерсен.");

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 223,
                column: "Content",
                value: "В текста са пропуснати САМО ПЕТ препинателни знака. Препишете ЦЕЛИЯ текст в листа за отговори, като поставите пропуснатите знаци.\r\nВ света на медицината т.нар. „бабини рецепти“ обикновено се свързват със суеверие. Оказва се обаче че доста от тях представляват интерес за съвременната наука доказателство за което е и книгата Бабини деветини. Използвайки най-новите изследвания авторът ѝ проучва повече от петдесет народни суеверия за да помогне на читателя да се ориентира кое е истина и кое – измислица.");

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 224,
                column: "Content",
                value: "В текста са пропуснати САМО ПЕТ препинателни знака. Препишете ЦЕЛИЯ текст в листа за отговори, като поставите пропуснатите знаци.\r\nДебютът ѝ в киното е през 1924 г. когато е само на деветнайсет. Не кой да е, а самият Робърт Вине я взема за ролята на младо девойче във филма си, озаглавен Имах един приятел. Играла под псевдонима Ива-Ваня младата българка се справя отлично. И критиците и зрителите много я харесват поради което продуценти и режисьори бързат да я ангажират за нови роли.");

            migrationBuilder.UpdateData(
                table: "Questions",
                keyColumn: "Id",
                keyValue: 225,
                column: "Content",
                value: "В текста са пропуснати САМО ПЕТ препинателни знака. Препишете ЦЕЛИЯ текст в листа за отговори, като поставите пропуснатите знаци.\r\nСава Огнянов е първородният син на Мина Горанова, на която Ботев посвещава творбата си Пристанала. Но за да я откъсне от поета баща ѝ я праща в Прага да учи пеене, а след това я омъжва за котленеца Петър Огнянов. По-късно Ботев споделя че е имал любима породила у него страстна любов угаснала тъй рано.");
        }
    }
}
